{
    "1_1": "Video lectures Admin lecture: Practical arrangements. What will happen when? This lecture: Overview of content. What is the course about? General advice for viewing this and later lectures . . . (cid:73) Each lecture: several videos organized into a playlist. (Average 50-60 minutes.) (cid:73) Mix of videos from this year and last year. (cid:73) Captions: may sometimes correct small errors or omissions. (cid:73) Quiz questions within lectures: for your private use only. (cid:73) Do post questions or comments on the lectures to Piazza, mentioning lecture and slide number. Use fridayqs to submit questions for live Q+A sessions. IADS Lecture 1 Slide 2 ",
    "1_2": "What are algorithms and data structures? Informatics 2 – Introduction to Algorithms and Data Structures Algorithms are basically methods or recipes for solving various problems. To write a program to solve some problem, we first need to know a suitable algorithm. Data structures are ways of storing or representing data that make it easy to manipulate. Again, to write a program that works with certain data, we first need to decide how this data should be stored and structured. IADS Lecture 1 Slide 3 ",
    "1_3": "Tasks calling for algorithms How would you efficiently . . . (cid:73) Sort 1000000000 names into alphabetical order? (Databases) (cid:73) Visit all web pages reachable from a given starting page? (Search engines) (cid:73) Find the shortest/fastest/cheapest route from A to B? (SatNav) (cid:73) Find the longest substring shared by two (long) strings? (Genetics) (cid:73) Tell whether a 100-digit number is prime or not? (Cryptography) In some cases there’s an ‘obvious’ method. Often there’s a non-obvious method that’s much more efficient. IADS Lecture 1 Slide 4 ",
    "1_4": "Problems, algorithms, programs IADS Lecture 1 Slide 5 ",
    "1_5": "There were algorithms before there were computers ‘Algorithms’ are so named after Muhammad al-Khw¯arizm¯ı, a 9th century Persian mathematician who wrote an important book on methods for arithmetic in decimal notation. (E.g. +, −, long ×, long /, Even earlier, there was Euclid’s greatest common divisor algorithm: √ .) GCD (4851, 840) = GCD (840, 651) = GCD (651, 189) = GCD (189, 84) = GCD (84, 21) = 21. But now that we have computers, algorithms are everywhere! IADS Lecture 1 Slide 6 ",
    "1_6": "Quiz question Which of the following is not a true statement about algorithms? 1. Typically, the same algorithm can be implemented in many diﬀerent programming languages. 2. Some old algorithms are still considered to be very efficient. 3. Some algorithms work OK on small examples, but don’t scale up to larger ones. 4. In order to design an algorithm for tackling some problem, you first need to write a program that solves it. IADS Lecture 1 Slide 7 ",
    "1_7": "Data structures How might you store a set of numbers (e.g. {5, 23, 3, 14, 2}) in a computer? In an array (sorted or not)? As a linked list? As a tree? Which of these make it easy . . . (cid:73) To test whether a given number (e.g. 11) is in the set? (cid:73) To add or remove a member of the set? Our choice of data structure may depend on which of these operations are most important for us. IADS Lecture 1 Slide 8 ",
    "1_8": "What makes computers go faster? Combination of . . . (cid:73) Hardware technology (e.g. processor speeds) (cid:73) Parallel processing (doing several things at once) (cid:73) Compiler techniques (e.g. optimization of machine code) (cid:73) Advances in algorithms / data structures. Even on ‘old’ algorithmic problems, new advances are still being made, sometimes leading to dramatic speed-ups on practical tasks. (cid:73) 2017: Major breakthrough in minwise hashing problem (from 1997) has led to order-of-magnitude improvement in near-duplicate detection, e.g. in search engines (Wang/Wang/Shrivastava/Ryu). (cid:73) 2018: Ideas of adaptive sampling give exponential speed-up on many optimization problems, e.g. taxi dispatch (Singer/Balkanski). In this sense, algorithms / data structures are a technology. People like GoogleTM certainly care about them, and ask questions about them at internship interviews! IADS Lecture 1 Slide 9 ",
    "1_9": "Rough outline of course (order slightly simplified) Approach via asymptotic analysis. (cid:73) Simple examples of efficient/inefficient algorithms. (cid:73) How can we measure how ‘good’ an algorithm is? (cid:73) Sorting algorithms: InsertSort, MergeSort, QuickSort, . . . (cid:73) Basic data structures: Ways of implementing lists, stacks, (cid:73) Algorithms on graphs: depth-first and breadth-first search, (cid:73) Dynamic programming: A way to avoid repeating work. (cid:73) Algorithms/data structures for language processing (e.g. of Java or Python source code). Grammars, syntax, parsing. (cid:73) What are the limits of algorithms and computation? Applications, e.g. seam carving for images. queues, sets, dictionaries, . . . topological sorting, shortest paths. Glance at complexity theory (intractable problems, P vs. NP) and computability theory (unsolvable problems, Turing machines, halting problem). IADS Lecture 1 Slide 10 ",
    "1_10": "Programming thread: Python The course will emphasize the relevance of algorithms/data struc- tures to practical programming. We’ll be using Python as our programming language, and one of our goals is to teach you this. (Used in many later-year courses). We’ll issue Python lab sheets, for you to work through at the computer at your own speed. Customized to this course: tie in closely with lecture material. Contain exercises for your own use (not submitted or marked). Online support available to help you with these sheets. Two of the three courseworks will involve Python programming. IADS Lecture 1 Slide 11 ",
    "1_11": "Other resources Learn page: reached from www.learn.ed.ac.uk. Everything will be made available here: lecture videos and slides, tutorial sheets, lab sheets, courseworks, link to discussion forum. Textbooks: (cid:73) Cormen, Leiserson, Rivest and Stein, Introduction to Algorithms (3rd edition). The classic. Also useful for Year 3 ADS; wealth of more advanced material. (cid:73) Goodrich, Goldwasser and Tamassia, Data Structures and Algorithms in Python. Programmer-oriented: starts with intro to Python! Closely matches first 2/3 of course. (cid:73) Sedgewick and Wayne, Algorithms (2016 edition). Java-based. (cid:73) Anything else you find helpful? Let us know! Reading for this lecture: CLRS Chapter 1. IADS Lecture 1 Slide 12 ",
    "1_12": "ENJOY THE COURSE! IADS Lecture 1 Slide 13 ",
    "2_1": "Inefficient vs. efficient algorithms Goal of lecture: Introduce some simple and important examples of algorithms, illustrating the diﬀerence between ‘efficient’ and ‘inefficient’ solutions. Problem 1 (toy example): Given a large decimal whole number n, compute n mod 9 (i.e. the remainder on dividing n by 9). Method A: Do division by school method; note the remainder. 4 1 6 4 7 3 5 2 5 3 7 7 2 8 9 9 ) 3 71458426631472248336965268087 rem 6 This is the ‘obvious’ method: no cleverness involved. IADS Lecture 2 Slide 2 ",
    "2_2": "Alternative method Method B: Add the digits of n to get a new number n(cid:48). Do the same to n(cid:48); repeat till we get down to a single digit d, If d = 9, answer is 0; otherwise answer is d. E.g. for n = 3748261728395607: 3+7+4+8+2+6+1+7+2+8+3+9+5+6+0+7 = 78 7 + 8 = 15 1 + 5 = 6 Why does this work? E.g. for a 4-digit number written abcd: 1000a + 100b + 10c + d = (999a + a) + (99b + b) + (9c + c) + d ≡ a + b + c + d (mod 9) IADS Lecture 2 Slide 3 ",
    "2_3": "Comparing methods A and B Advantages of method B: (cid:73) Faster, at least for humans (though not spectacularly so). (cid:73) More ﬂexible: can add digits in whatever order you like. (cid:73) Can be parallelized (you add first 8 digits, I’ll add last 8). Moral: Using mathematical insight, improvements over the ‘obvious’ algorithm may be possible. Improved algorithm may be ‘non-obvious’ and may need justifying. IADS Lecture 2 Slide 4 ",
    "2_4": "Modular exponentiation Problem 2: Given (large) whole numbers a, n, m, compute an mod m. E.g. 210 mod 17 = 1024 mod 17 = 4. Believe it or not, this problem is absolutely fundamental to modern cryptosystems (e.g. RSA, as explained in DMP course). Method A: Literally compute an, then reduce modulo m. (cid:73) If e.g. a = 3, n = 123456789012345678901234, then an won’t even fit in memory. (cid:73) In any case, working with very big numbers is time-consuming. IADS Lecture 2 Slide 5 ",
    "2_5": "Modular exponentiation, continued Method B: Start from a. Do (n − 1) multiplications by a, but reduce mod m each time. Works because: (x × y ) mod m = ((x mod m) × (y mod m)) mod m E.g. for 210 mod 17: 2 × 2 = 4, 4 × 2 = 8, 8 × 2 = 16, 16 × 2 = 32 ≡ 15, 15 × 2 = 30 ≡ 13, 13 × 2 = 26 ≡ 9, 9 × 2 = 18 ≡ 1, 1 × 2 = 2, 2 × 2 = 4. (cid:73) Now numbers never get bigger than am. (cid:73) But still impractical if n = 123456789012345678901234. IADS Lecture 2 Slide 6 ",
    "2_6": "Fast modular exponentiation Method C: Notice that it’s easy to compute e = an mod m if we’ve already computed d = a(cid:98)n/2(cid:99) mod m: (cid:73) If n is even, take e = (d × d) mod m. (cid:73) If n is odd, take e = (d × d × a) mod m. This suggests the following recursive algorithm: Expmod (a,n,m): # Computes an mod m if n=0 then return 1 else d = Expmod (a,(cid:98)n/2(cid:99),m) if n is even return (d × d) mod m else return (d × d × a) mod m (Example of pseudocode: informal mix of programming constructs, math notation, and English. Useful for expressing algorithms in a readable way.) IADS Lecture 2 Slide 7 ",
    "2_7": "Example of Method C Expmod (a,n,m): if n=0 then return 1 else d = Expmod (a,(cid:98)n/2(cid:99),m) if n is even return (d × d) mod m else return (d × d × a) mod m Imagine each evaluation of Expmod is done by a diﬀerent ‘person’: Us to A: A to B: B to C: C to D: D to E: E to D: D to C: C to B: B to A: A to us: What’s Expmod (2,10,17) ? What’s Expmod (2,5,17) ? What’s Expmod (2,2,17) ? What’s Expmod (2,1,17) ? What’s Expmod (2,0,17)? 1 1 × 1 × 2 mod 17 = 2 2 × 2 mod 17 = 4 4 × 4 × 2 mod 17 = 15 15 × 15 mod 17 = 4. This is feasible even when a, n, m are large (say ∼ 1000 digits). IADS Lecture 2 Slide 8 ",
    "2_8": "Some Python experiments Time in milliseconds to compute 3n mod 2n (on my laptop): n Method A Method B Method C min(A,B)/C 10 100 1000 10000 100000 1000000 10000000 100000000 1000000000 .0027 .0041 .0092 .133 2.81 101. 3986. 149000 crashed 0.49 0.58 1.21 13.3 176. 5941. 68700. 587000. 9680000. — .0051 .0134 .1229 2.41 10.46 127. 1168. 11150 213000 — .0055 .0071 .0076 .010 .016 .017 .017 .019 .022 .656 10100 — Key idea: It’s not just that my Python program for C is the best. Rather, the algorithm itself is vastly, fundamentally superior. How do we make this idea precise? IADS Lecture 2 Slide 9 ",
    "2_9": "Digression: Primality testing Fermat’s little theorem: If n is prime and 0 < a < n, then an−1 mod n = 1. [Proved in DMP.] Application: Let n be the following 270-digit number. 412023436986659543855531365332575948179811699844327982845455 626433876445565248426198098870423161841879261420247188869492 560931776375033421130982397485150944909106910269861031862704 114880866970564902903653658867433731720813104105190864254793 282601391257624033946373269391 My Python ‘Program C’ takes <5 ms to discover that 2n−1 mod n = ··· (cid:54)= 1. Conclusion: n is not prime. So what are its factors? If you knew, you’d be (slightly) famous. This is RSA-896, not yet cracked. ($75,000 prize sadly withdrawn!) Note: This isn’t a perfect primality test: a few non-primes (e.g. 561) masquerade as primes. But for big numbers, error probability is very small — and by refining the test, can be made even smaller (Miller-Rabin test). IADS Lecture 2 Slide 10 ",
    "2_10": "Insert-sort Problem 3: Given an array A containing n whole numbers, construct an array B containing the same n numbers in non-decreasing order. Method A (‘obvious’): Go through elements of A one by one. Copy them into B, filling B from left to right, and inserting each element in its correct position. IADS Lecture 2 Slide 11 ",
    "2_11": "Insert-sort: in-place version Actually, don’t need a separate array B: can do everything within A itself (in-place sorting). Just need to be able to hold one number ‘in our hand’ at any given time. In pseudocode: InsertSort(A): for i = 1 to |A|−1 # |A| means size of A x = A[i] j = i−1 while j ≥ 0 and A[j] > x A[j+1] = A[j] j = j−1 A[j+1] = x IADS Lecture 2 Slide 12 ",
    "2_12": "Merge-sort Method B (less obvious). Split A into two halves. Sort these separately, then merge the results. Merge (B,C): allocate D of size |B| + |C| i = j = 0 for k = 0 to |D|−1 if B[i] < C[j] # Convention: ∞ if index out of range D[k] = B[i], i = i+1 D[k] = C[j], j = j+1 else return D IADS Lecture 2 Slide 13 ",
    "2_13": "Merge-sort: Recursive application of Merge IADS Lecture 2 Slide 14 ",
    "2_14": "Merge-sort continued A recursive sorting algorithm: MergeSort (A,m,n): if n−m = 1 # sorts A[m], A[m+1], . . . , A[n−1] # returning result in an array D of size n−m else return [ A(m) ] p = (cid:98)(m+n)/2(cid:99) B = MergeSort (A,m,p) C = MergeSort (A,p,n) D = Merge (B,C) return D MergeSortAll (A): return MergeSort (A,0,|A|) IADS Lecture 2 Slide 15 ",
    "2_15": "Python again Time in milliseconds to sort a list of length n. (Entries were random whole numbers < n2.) n 10 100 1000 10000 100000 1000000 10000000 100000000 Insert-sort Merge-sort .023 .97 69.8 8210. 906000. – – – .068 .74 7.9 76.2 1080. 13300. 158000. 2619000. Speedup 0.34 1.31 8.84 107. 839. So merge-sort seems fundamentally superior (as regards runtime). Again, how can we make this precise? And why is merge-sort so much better? What’s going on here? Will explore this next time. IADS Lecture 2 Slide 16 ",
    "2_16": "Reading (cid:73) Insert sort: CLRS 2.1 (cid:73) Merge sort: CLRS 2.3 (cid:73) Modular exponentiation: CLRS 31.6, second half (cid:73) [RSA challenge numbers: good Wikipedia pages.] Today’s music: Fryderyk Chopin, Minute Waltz IADS Lecture 2 Slide 17 ",
    "3_1": "Outline Goal of Lectures 3,4,5: (cid:73) Introduce asymptotic analysis, the core mathematical theory used in this course. Centres around a certain ‘Gang of Five’: o O Θ Ω ω (cid:73) Apply this theory to InsertSort and MergeSort. Purpose of the theory: Way of making precise, quantitative statements about efficiency properties of algorithms themselves. (E.g. What do all implementations of MergeSort have in common?) Note: These ideas may take a while to master – don’t worry! This lecture: In what sense is MergeSort ‘fundamentally faster’ than InsertSort? o and ω. IADS Lecture 3 Slide 2 ",
    "3_2": "Comparing runtimes for InsertSort and MergeSort Take some specific implementations of InsertSort and MergeSort. Broadly, we want to consider . . . TI (n) = time taken by InsertSort on a list of length n (in ms) TM (n) = time taken by MergeSort on a list of length n Which list of length n? Time may vary widely between lists! Will come back to this. For now, take TI (n), TM (n) to be the worst-case (i.e. maximum) times for a list of length n. Could then plot a graph (schematic only): IADS Lecture 3 Slide 3 ",
    "3_3": "Comparing TI and TM How can we capture our intuition ‘TI grows much faster than TM ’ ? Attempt 1: ∀n. TM (n) < TI (n). Not true! We’ve seen that for small n, InsertSort is faster. Really want to say that MergeSort is eventually faster. Attempt 2: ∃N.∀n ≥ N. TM (n) < TI (n). True. E.g. N = 100 would do here. But doesn’t capture the essential diﬀerence . . . IADS Lecture 3 Slide 4 ",
    "3_4": "Comparing growth rates Attempt 3: Idea is that we expect that any impl of MergeSort will eventually beat any impl of InsertSort. E.g. suppose we gave InsertSort an unfair advantage by running it on a machine 100 times faster. Even TI (n)/100 would eventually overtake TM (n): In symbols: ∃N.∀n ≥ N. TM (n) < 0.01TI (n). (E.g. N = 100000 would do here.) Question: What if we replaced 0.01 by 0.0001? Or by 0.000001? IADS Lecture 3 Slide 5 ",
    "3_5": "Growth rates and ‘little o’ Intuition (will justify later): For any handicap factor c, however close to zero, cTI (n) will eventually break out and overtake TM : ∀c > 0. ∃N. ∀n ≥ N. TM (n) < cTI (n) We express this by saying TM is o(TI ). Can read this as: ‘TM is slower-growing than’ or ‘asymptotically smaller than TI ’. In general, we say f is o(g ) if ∀c > 0. ∃N. ∀n ≥ N. f (n) < cg (n) (Here f , g : N → R≥0, c ranges over R, and N, n range over N.) Equivalent to saying g (n)/f (n) → ∞ as n → ∞ (if f : N → R>0). IADS Lecture 3 Slide 6 ",
    "3_6": "o-notation: Simple examples Will come back to InsertSort and MergeSort later. Meanwhile, some simpler examples of o. Example 1: Is it true that n2 is o(n3)? YES! Informal justification: The ratio n3/n2 is n, which (trivially!) tends to ∞ as n tends to ∞. Rigorous justification: Want to show that the o formula is satisfied: ∀c > 0. ∃N. ∀n ≥ N. n2 < cn3 Suppose we’re given some c > 0. Need to pick a suitable N. Take any N > 1/c. Then for all n ≥ N, we have cn3 = cn.n2 ≥ cN.n2 > c(1/c)n2 = n2 (Idea: If n > 1/c, the extra factor n will compensate for the c.) IADS Lecture 3 Slide 7 ",
    "3_7": "Examples of o-notation, continued √ Example 2: Is it true that 100 n is o(n)? √ Informal justification: The ratio n/(100 to ∞ as n tends to ∞. Rigorous justification: Want to show that the o formula is satisfied: n/100, which tends YES! n) is √ √ ∀c > 0. ∃N. ∀n ≥ N. 100 n < cn Suppose we’re given some c > 0. Need to pick a suitable N. Take any N > 10000/c 2. Then for all n ≥ N, we have √ √ cn = c n √ n ≥ c √ √ n > c(100/c) N √ n = 100 n How did we pick that 10000/c 2? √ E.g. by working backwards from the requirement n/(100 n) > 1/c. IADS Lecture 3 Slide 8 ",
    "3_8": "Examples of o-notation, continued Example 3: Is it true that n + 1000000 is o(6n)? NO! Informal justification: Even though the ratio 6n/(n + 1000000) continues to increase as n tends to ∞, it never exceeds 6, so doesn’t tend to ∞. Rigorous justification: Want to show the negation of the o formula: ¬ (∀c > 0. ∃N. ∀n ≥ N. n + 1000000 < c.6n) which is equivalent to ∃c > 0. ∀N. ∃n ≥ N. n + 1000000 ≥ c.6n We can take c = 1/7. It’s then true for any n ≥ 0 that n + 1000000 > n ≥ 6n/7 = c.6n So it’s clear that ∀N.∃n ≥ N. n + 1000000 ≥ c.6n (given N, can just take n = N). IADS Lecture 3 Slide 9 ",
    "3_9": "What is ‘o(g )’ officially? Officially, o(g ) is a set: namely, the set of all f that ‘are o(g )’. o(g ) = {f : N → R≥0 | ∀c > 0. ∃N. ∀n ≥ N. f (n) < cg (n)} So, ‘f is o(g )’ technically means f ∈ o(g ). Common convention: Write ‘o(g )’ to mean ‘some (unspecified) function in the set o(g )’. E.g. f = o(g ) , f (n) = 3n2 + o(n) Needs care: e.g. n = o(n2) and 2n = o(n2) don’t imply n = 2n ! But many useful laws are valid, e.g. o(g ) + o(g ) = o(g ) which strictly means ‘if f ∈ o(g ) and f (cid:48) ∈ o(g ), then f +f (cid:48) ∈ o(g )’. (Exercise if you like maths: Prove this from the definition of o.) IADS Lecture 3 Slide 10 ",
    "3_10": "Reducing clutter using o Asymptotic notation is useful when we’re only interested in the broad headlines of how some function behaves. E.g. Can read 3n2 + o(n) as ‘3n2 plus small change.’ Reduces clutter and simplifies calculations! Example: How does the following behave for large n? √ n / lg n) + 12) √ (3n + 5 n + 17 lg n) (4n + ( (In this course, lg means logarithm to base 2.) Rather than expanding this in full, can reason as follows: (3n + o(n) + o(n))(4n + o(n) + o(n)) = (3n + o(n))(4n + o(n)) = 12n2 + o(3n2) + o(4n2) + o(n2) = 12n2 + o(n2) (where every step can be rigorously justified). IADS Lecture 3 Slide 11 ",
    "3_11": "Some key points (cid:73) Saying f = o(g ) gives just the main headlines of how f and g are related: ‘In the limit, f is vanishingly small relative to g ’. Often, this is all we care about. (cid:73) f = o(g ) makes a robust statement about f , g . E.g. unaﬀected by scaling: f = o(g ) ⇔ 3f = o(0.2g ). implementations of MergeSort/InsertSort. (cid:73) So can expect that e.g. ‘TM = o(TI )’ will remain true for any (cid:73) Use of o can reduce clutter and simplify calculations. (cid:73) But without sacrificing mathematical rigour: ‘f = o(g )’ has a precisely defined meaning. General advice: Sketch graphs to understand what’s going on! IADS Lecture 3 Slide 12 ",
    "3_12": "And finally: ω ω is dual to o. Recall that f = o(g ) means: ∀c > 0. ∃N. ∀n ≥ N. f (n) < cg (n) (‘f is asymptotically smaller than / grows slower than g ’). By contrast, read f = ω(g ) as saying: ‘f is asympotically larger than / grows faster than g ’). Formal definition: f is ω(g ) if ∀C > 0. ∃N. ∀n ≥ N. f (n) > Cg (n) (‘However much we scale g up by, f will eventually overtake it.’) For purpose of comparing f and g , scaling g ‘up’ by C has same eﬀect as scaling f ‘down’ by c = 1/C . So easy to show: f = ω(g ) if and only if g = o(f ) (Compare: x > y if and only if y < x.) We’ll tend to use o more than ω. IADS Lecture 3 Slide 13 ",
    "3_13": "Next time: O, Ω, Θ. (Most presentations start with these!) Reading for Lectures 3 and 4: CLRS Chapter 3, GGT Sections 3.3, 3.4 Today’s music: J.S. Bach, Toccata in D minor. IADS Lecture 3 Slide 14 ",
    "4_1": "Where we’re heading . . . Recall our runtime functions TI , TM for InsertSort, MergeSort. We’ve seen that TM grows slowly relative to TI : TM = o(TI ). Can we place growth rates of TI , TM on some absolute scale? E.g. consider the following hierarchy of ‘simple’ functions: √ f2(n) = n f5(n) = n2 f8(n) = 22n f1(n) = lg n f4(n) = n lg n f7(n) = 2n f0(n) = 1 f3(n) = n f6(n) = n3 ··· Here f0 ∈ o(f1), f1 ∈ o(f2), . . . Which of the above functions do TI and TM most closely ‘resemble’ in their essential growth rate? IADS Lecture 4 Slide 2 ",
    "4_2": "The big guys: O, Ω, Θ We’re going to define a relation f is Θ(g ) Read as ‘f has same essential growth rate as g ’. Often used to classify ‘complicated’ functions via ‘simple’ ones. E.g. it will turn out that TI is Θ(n2), and TM is Θ(n lg n). Approach: First define f is O(g ) f is Ω(g ) ‘f grows no faster than g ’ ‘f grows no slower than g ’ Then say: f is Θ(g ) ⇐⇒ f is O(g ) and f is Ω(g ). IADS Lecture 4 Slide 3 ",
    "4_3": "Big O ‘small’ values of n, The spirit of asymptotics is that: (cid:73) we only care about behaviour ‘in the limit’ — can discard (cid:73) constant scaling factors are washed out. So let’s say f grows no faster than g , if f is eventually bounded above by some (sufficiently large) multiple Cg of g : ∃C > 0. ∃N. ∀n ≥ N. f (n) ≤ Cg (n) Write as f is O(g ), and call g an asymptotic upper bound for f . IADS Lecture 4 Slide 4 ",
    "4_4": "Big O: an example Suppose f (n) = 3n + √ n and g (n) = n. Claim: f is O(g ). Or more simply, f is O(n). Proof: Need to show ∃C . ∃N. ∀n ≥ N. 3n + √ n ≤ Cn Take C = 4, N = 1. Then for all n ≥ N = 1, we have Intuition: 3n is the ‘dominant’ term; √ n is ‘small change’. √ n ≤ n, so n ≤ 4n = Cn √ 3n + IADS Lecture 4 Slide 5 ",
    "4_5": "Comparing o and O We’ve defined: f is o(g ) means ∀c > 0. ∃N. ∀n ≥ N. f (n) < cg (n) f is O(g ) means ∃C > 0. ∃N. ∀n ≥ N. f (n) ≤ Cg (n) (cid:73) For o we require that any multiple of g eventually overtakes f . (cid:73) For O it’s enough that some multiple of g does. So f = o(g ) implies f = O(g ). But not conversely: e.g. f = O(f ) for any f , but f is never o(f ). Loosely, can think of o as like <, O as like ≤. Notation: Again, O(g ) is officially a set: O(g ) = {f | ∃C ≥ 0. ∃N. ∀n ≥ N. f (n) ≤ Cg (n)} But common to write e.g. f = O(g ) for f ∈ O(g ). IADS Lecture 4 Slide 6 ",
    "4_6": "Big O: more examples Example 1: Let f (n) = (5n + 4)(7n + 100). Is f = O(n2)? YES! Informal justification: The dominant term is 35n2; the rest is small change that is clearly o(n2). So f is O(n2). Rigorous justification: Want to show: ∃C . ∃N. ∀n ≥ N. (5n + 4)(7n + 100) ≤ Cn2 Note that (cid:73) 5n + 4 ≤ 6n once n ≥ 4 (cid:73) 7n + 100 ≤ 8n once n ≥ 100. So for all n ≥ 100, we have f (n) ≤ 48n2. In other words, C = 48, N = 100 will work. IADS Lecture 4 Slide 7 ",
    "4_7": "A bit of freedom here . . . We wanted to show ∃C . ∃N. ∀n ≥ N. (5n + 4)(7n + 100) ≤ Cn2 We did this by picking C = 48, N = 100. There’s some freedom of choice here. By picking a larger C , can often get away with a smaller N. E.g. once n ≥ 4, have 5n + 4 ≤ 6n and 7n + 100 ≤ 32n. So could equally well take C = 6 × 32 = 192, N = 4. Advice: Make life easy for yourself! IADS Lecture 4 Slide 8 ",
    "4_8": "More examples Example 2: Let f (n) = (5n + 4)(7n + 100). Is f = O(n3)? YES! We’ve already shown So certainly ∀n ≥ 100. f (n) ≤ 48n2 ∀n ≥ 100. f (n) ≤ 48n3 Here we say O(n3) is an asymptotic upper bound for f , though not a tight upper bound. We’d write f = Θ(n3) to mean n3 was an asymptotic upper and lower bound (hence tight). Not true here! Some authors are less precise in distinguishing O and Θ (see CLRS, end of Chapter 3). IADS Lecture 4 Slide 9 ",
    "4_9": "More examples Example 3: Is 22n = O(2n)? NO! Informal justification: The ratio 22n/2n is 2n, which tends to ∞ and so will eventually exceed any given constant C . In fact, 22n = ω(2n). Rigorous justification: Want to show: ¬ (∃C > 0. ∃N. ∀n ≥ N. 22n ≤ C .2n) in other words ∀C > 0. ∀N. ∃n ≥ N. 22n > C .2n Given any C > 0 and N, take any n > max(N, lg C ). Then 2n > C , so 22n > C .2n. Moral: Do ‘constant factors’ matter? Depends where they occur! IADS Lecture 4 Slide 10 ",
    "4_10": "Big O: final example Example 4: Is lg(n7) = O(lg n)? YES! Note that lg(n7) = 7 lg n. So C = 7, N = 1 will do. IADS Lecture 4 Slide 11 ",
    "4_11": "Big Ω Ω is dual to O. Read f is Ω(g ) as: ‘f grows no slower than g ’, or ‘g is an asymptotic lower bound for f ’. E.g. for some runtime function T (n): (cid:73) T (n) = O(g ) says runtime is not essentially worse than g (n), (cid:73) T (n) = Ω(g ) says runtime is not essentially better than g (n). f = Ω(g ) says f is eventually bounded below by some (sufficiently small) multiple cg of g : ∃c > 0. ∃N. ∀n ≥ N. cg (n) ≤ f (n) Not hard to show f = Ω(g ) ⇐⇒ g = O(f ). IADS Lecture 4 Slide 12 ",
    "4_12": "Big Ω: example Is it true that n − √ is large. So growth rate of n − √ Informal justification: n is Ω(n)? √ YES! n becomes negligible relative to n when n n is essentially that of n. Rigorous justification: Want to show: ∃c. ∃N. ∀n ≥ N. cn ≤ n − √ n Take c = 1/2, N = 4. Then for all n ≥ N = 4, we have √ n ≤ n/2, so n − √ n ≥ n − n/2 = n/2 = cn IADS Lecture 4 Slide 13 ",
    "4_13": "Big Θ Can now capture the idea that f and g have ‘essentially the same growth rate’. Say f is Θ(g ) (or g is an asymptotically tight bound for f ) if both f ∈ O(g ) and f ∈ Ω(g ). Equivalently, f ∈ Θ(g ) if and only if ∃c1, c2 > 0. ∃N. ∀n ≥ N. c1g (n) ≤ f (n) ≤ c2g (n) Note also that f = Θ(g ) ⇐⇒ g = Θ(f ). IADS Lecture 4 Slide 14 ",
    "4_14": "Examples of Θ For each of the following functions f , identify some ‘simple’ g such that f = Θ(g ). Example 1: f (n) = 3n2 − 2n + 19. The dominant term is 3n2, the rest is small change. So f (n) will eventually be sandwiched between 2n2 and 4n2. (Specifically, can take e.g. c1 = 2, c2 = 4, N = 5.) Example 2: f (n) = 5 − 4/n. That is, we’re taking our ‘g ’ to be the constant function g (n) = 1. Then for any n ≥ 1, we have Answer: f (n) = Θ(n2). Answer: f (n) = Θ(1). 1.g (n) = 1 ≤ 5 − 4/n ≤ 5 = 5.g (n) So taking c1 = 1, c2 = 5, N = 1 will work. IADS Lecture 4 Slide 15 ",
    "4_15": "Harder example Identify some simple g such that f = Θ(g ). i=11/i. Example 3: f (n) = Σn E.g. f (4) = 1 + 1/2 + 1/3 + 1/4 = 2 1 12 . Answer: f (n) = Θ(ln n). Idea: f (n) is close to(cid:82) n 1 (1/x)dx, which is ln n. E.g. for n = 4: IADS Lecture 4 Slide 16 ",
    "4_16": "Growth rates and algorithms Let’s return to an earlier question. Suppose each implementation J of (say) MergeSort yields some runtime function TJ . Question: What do we expect all these TJ to have in common? Answer: Same growth rate! ∀J, J(cid:48) implementing MergeSort. TJ = Θ(TJ(cid:48)) Will justify this next time, and furthermore see that ∀J implementing MergeSort. TJ = Θ(n lg n) Idea: Asymptotic notation can crisply express essential properties of algorithms, abstracting away from implementation detail. Of the Gang of Five, we’ll meet O and Θ most often. IADS Lecture 4 Slide 17 ",
    "4_17": "Reading (same as last time): CLRS Chapter 3, GGT Sections 3.3, 3.4 Today’s music: Richard Strauss, Also sprach Zarathustra. IADS Lecture 4 Slide 18 ",
    "5_1": "Algorithms and cost models We’re interested in the cost of various algorithms, for various notions of cost. (Runtime, memory use, disk operations, . . . ). To analyse this, need some cost model: i.e. some definition of how we intend cost to be measured. Diﬀerent cost models are useful for diﬀerent purposes. We’ll initially consider runtime cost. But even here, diﬀerent cost models are possible. E.g. for sorting algorithms, might measure. . . 1. number of comparisons (<) between items, 2. number of ‘basic steps’ performed – e.g. ‘machine instructions’ for some (idealized) machine model. This lecture: Start with 1, then move towards 2. IADS Lecture 5 Slide 2 ",
    "5_2": "Best case, worst case, average case Often want to estimate runtime on ‘inputs of size n’. (E.g. time taken to sort lists of length n.) Typically, diﬀerent inputs of size n give diﬀerent runtimes! However, the best case, worst case and (sometimes) average case times give well-defined functions we can talk about. IADS Lecture 5 Slide 3 ",
    "5_3": "Best/worst case and asymptotic bounds that manifest this bad behaviour. Informally . . . (cid:73) Tworst = O(g ) says the worst-case runtime (hence any runtime) is essentially no worse than g . Can then just say ‘runtime is O(g )’. (cid:73) Tworst = Ω(g ) says runtime can be as bad as g , i.e. there are inputs (cid:73) Tworst = Θ(g ) says both these things. (cid:73) Tbest = Ω(g ) says best-case runtime (hence any runtime) is essentially no better than g . Can then say ‘runtime is Ω(g )’. (cid:73) Tbest = O(g ) says runtime can be as good as g . (cid:73) Tbest = Θ(g ) says both these things. Moral: Don’t confuse ‘O/Ω/Θ’ with ‘best/worst/average’ ! (See CLRS pages 48-49.) IADS Lecture 5 Slide 4 ",
    "5_4": "InsertSort: ‘number of comparisons’ analysis Pseudocode for InsertSort again (line numbers added): 0 1 2 3 4 5 6 7 InsertSort(A): for i = 1 to n−1 # write n for size of A x = A[i] j = i−1 while j ≥ 0 and A[j] > x A[j+1] = A[j] j = j−1 A[j+1] = x How many times is the ‘>’ on line 4 invoked? (cid:73) For each value of i, may consider execution of lines 2–7. This invokes > at most i times. (Loop starts at j = i−1 and stops at j = −1, if not before). (cid:73) But i itself runs from 1 to n−1 (line 1). (cid:73) So total number of ‘>’ ops is at most Σn−1 i=1 i = O(n2). IADS Lecture 5 Slide 5 ",
    "5_5": "‘Worst case’ number of comparisons We’ve seen that Σn−1 of comparisons. So can say InsertSort does O(n2) comparisons. i=1 i = n(n − 1)/2 is an upper bound for number But is it ever actually this bad? I.e. is this upper bound attained? For any n, consider how InsertSort will behave on the input [n, n − 1, . . . , 2, 1]. Recall the inner loop: 4 5 6 while j ≥ 0 and A[j] > x A[j+1] = A[j] j = j−1 Not hard to see that all the comparisons A[j] > x will yield True. So for each i, this ‘j-loop’ will run until j = −1. So there will be exactly n(n − 1)/2 comparisons. Headline is that the worst-case time is Ω(n2), hence Θ(n2). IADS Lecture 5 Slide 6 ",
    "5_6": "What about ‘best case’ ? What’s the smallest number of comparisons that InsertSort could possibly perform on a size n input? j = i−1 while j ≥ 0 and A[j] > x 3 4 5 6 A[j+1] = A[j] j = j−1 For each value of i, this j-loop will do at least one comparison (first time round, when j = i−1). So the whole program performs at least n−1 comparisons. Is this lower bound attained? Yes: when input is already sorted! So best-case number of comparisons is Θ(n). Can now say: number of comparisons performed by InsertSort on size n inputs is O(n2) and Ω(n). IADS Lecture 5 Slide 7 ",
    "5_7": "‘Average case’ for InsertSort We’ve looked at worst and best cases. But how many comparisons will InsertSort perform on average? For simplicity, assume input A is some permutation of n distinct elements x0 < . . . < xn−1, with all n! permutations ‘equally likely’. Let Tav (n) = average number of comparisons for these n! inputs. That is, if Pn is the set of n! orderings of {x0, x1, . . . , xn−1}, then ((cid:93) comparisons on input [p(0), . . . , p(n − 1)]) (cid:88) Tav (n) = 1 n! p∈Pn It can be shown that Tav (n) = n2/4 − O(n) (compare Tworst(n) = n2/2 − O(n)). Anyway, Tav (n) = Θ(n2). IADS Lecture 5 Slide 8 ",
    "5_8": "MergeSort: comparison analysis First recall the Merge operation for merging two already sorted arrays B and C , of combined length m (i.e. |B| + |C| = m). How many comparisons does this perform? (Assume we stop doing comparisons once B or C is used up.) Reasoning informally . . . (cid:73) At most m − 1. Every comparison yields a new element for the result list D, and the very last element gets put in without a comparison. (cid:73) At least min(|B|,|C|). And if |B| and |C| diﬀer by at most 1 (as they will in MergeSort), this is m/2 − O(1). So can say that number of comparisons done by Merge (within MergeSort) is Θ(m). Now what about MergeSort itself? IADS Lecture 5 Slide 9 ",
    "5_9": "Analysis of MergeSort, ctd. For simplicity, suppose first that we’re sorting a list of size n = 2k . We’ll reason informally. Recall our diagram: All the comparisons/merging happen in the bottom half. (cid:73) On each ‘level’, total number of elements is n. (cid:73) And for each merge, (cid:93)comparisons < (cid:93)elements involved. (cid:73) So total (cid:93)comparisons for merges on each level is < n. (cid:73) And there are lg n = k levels. So total (cid:93)comparisons is < n lg n. Even if n isn’t a power of 2, can show with a little care that (cid:93)comparisons is < n(cid:100)lg n(cid:101), which is certainly O(n lg n). IADS Lecture 5 Slide 10 ",
    "5_10": "MergeSort: worst, best and average case What about a lower bound? We’ve seen that on sorted lists of total size m, diﬀering in size by at most 1, Merge requires Ω(m) comparisons. Using this, can show that on lists of length n, MergeSort requires Ω(n lg n) comparisons. (Requires some care!) So Tworst = O(n lg n), Tbest = Ω(n lg n). Can immediately conclude that Tworst, Tbest, Tav are all Θ(n lg n). (Shown without deriving exact formulae for Tworst, Tbest, Tav !) Summary: In worst and average cases, MergeSort is asymptotically better than InsertSort (n lg n = o(n2)). But InsertSort does better in best case (n = o(n lg n)). IADS Lecture 5 Slide 11 ",
    "5_11": "Measuring ‘overall runtime’ Consider again InsertSort (for integer arrays): # write n for size of A for i = 1 to n−1 0 InsertSort(A): 1 2 3 4 5 6 7 x = A[i] j = i−1 while j ≥ 0 and A[j] > x A[j+1] = A[j] j = j−1 A[j+1] = x Common to take number of line executions as measure of runtime. Broad justification: Think about how the pseudocode would be imple- mented on a typical Random Access Machine (RAM). (Think 32-bit or 64-bit computer . . . except that word size/number of words may be taken as large as required for the given input.) Claim: Each line execution takes Θ(1) time (i.e. between two positive constants t < t(cid:48)). This implies that, for any such impl, total execution time = Θ(number of line executions) Warning! Applies only when each line execution does just a bounded amount of work. E.g. What if ‘>’ is comparison for strings? IADS Lecture 5 Slide 12 ",
    "5_12": "Overall runtime of InsertSort and MergeSort Can do ‘line execution’ analyses of InsertSort and MergeSort using same ideas as before. E.g. In InsertSort, for each value of i, execution of lines 2–7 takes ≤ 3i + 3 line executions . . . In this case, this tells the same story as our previous analyses: InsertSort MergeSort Θ(n lg n) Θ(n lg n) Θ(n lg n) Best Θ(n) Worst Θ(n2) Average Θ(n2) IADS Lecture 5 Slide 13 ",
    "5_13": "Space complexity Let’s also look brieﬂy at the memory requirements of our algorithms on size n inputs. Sensible to ignore the space occupied by the input array A, and consider the extra space needed. Easy to see that . . . (cid:73) ‘External’ InsertSort (putting result in new array B) requires Θ(n) extra space. (cid:73) In-place InsertSort requires only Θ(1) extra space (just i,j,x). (cid:73) MergeSort apparently requires Θ(n log n) space (total size of arrays created). (cid:73) However, with more careful memory management, MergeSort can be implemented using just Θ(n) extra space. Idea is that after doing D = Merge (B,C), space occupied by ‘temporary’ arrays B,C can be reclaimed. Headline: In-place InsertSort wins on space efficiency. IADS Lecture 5 Slide 14 ",
    "5_14": "‘End of Part 1’ That completes our introduction to the general concepts that underpin this course. Next time: Start on data structures — beginning with how program data is organized in memory. Today’s reading: CLRS 2.2. IADS Lecture 5 Slide 15 ",
    "6_1": "Representations of data Having seen a few algorithms, we now turn to data structures: i.e. ways of representing/structuring data in memory. In due course, we’ll see how to implement our own data structures. But we start at the bottom, with the ‘primitive’ data structures that programming languages typically provide as built-in. Actually, we’ll begin one step further back: How, in general, is program data organized in memory? Picture is broadly similar for most modern programming languages (Java, Python, Haskell, . . . ): Stack and Heap. Remember: simplifying a bit, we think of memory as consisting of words each with an address (i.e. location). Any address can be itself be stored in a single word — though there may be fewer addresses than word values. IADS Lecture 6 Slide 2 ",
    "6_2": "Typical organization of program data in memory IADS Lecture 6 Slide 3 ",
    "6_3": "Program memory: summary (cid:73) Values of program variables are stored on a stack, which grows and shrinks as variables come in and out of scope. (cid:73) Stack items are contiguously arranged in memory, so must have fixed size (e.g. 1 or 2 words). (cid:73) Typically, a stack item contains either a basic value (e.g. 561, True) or a reference to something on the heap. (cid:73) Heap objects can live anywhere in memory, be of any size, and may contain references to other heap objects. (cid:73) When heap objects are created (allocated), the memory manager will decide where to put them. But references to other objects can be changed later – so we can end up with a real mess! (cid:73) As execution proceeds, some heap objects may become unreachable. In many languages (e.g. Java, Python, Haskell), a garbage collector (i.e. memory recycler) detects this and reclaims the space. IADS Lecture 6 Slide 4 ",
    "6_4": "Details may vary . . . Our picture is mostly ‘Java-like’ (except for the mixed-type array). (cid:73) In Java, anything of reference type (including ‘objects’ and ‘arrays’) lives on the heap. In C, built-in ‘arrays’ live on the stack, and their size is static: an array variable A has an associated size fixed throughout its lifetime. (cid:73) Python also oﬀers ‘lists’ and ‘arrays’, both implemented much like the heap array in our picture. (Diﬀerence: ‘lists’ allow mixed types.) In functional programming languages (Haskell, ML, Lisp), ‘lists’ are more typically implemented as linked lists. Java oﬀers many classes for ‘lists’, e.g. ArrayList, LinkedList. (cid:73) In Java, all reference types have special value null (‘pointer to nowhere’). Default initial value for any variable/field of ref type. Closest Python equivalent is None – this is actually a reference to a specific object, with no fields or methods. Idea: Once we have the basic picture, we have a framework for understanding such diﬀerences. IADS Lecture 6 Slide 5 ",
    "6_5": "Assignment by reference In Python or Java, assignment statements have the form variable = expression E.g. s = \"smiles\"[1:5] # assigns ref to s What does an expression actually evaluate to? Either a basic value or a reference to a heap object. (Or null in Java.) List example: This matters! Think what happens when we do L1[2] = 5. A heap object will be ‘copied’ only if we request it (e.g. using ‘[:]’ for lists in Python). Similarly in Java (copying often done by a clone() method). IADS Lecture 6 Slide 6 ",
    "6_6": "Shallow vs. deep cloning In Python, ‘[:]’ makes only a shallow clone: copies ‘top level only’. E.g. think about lists of lists: Again, think what happens with L1[2] = 5. For a deep clone (fresh copy of entire structure, with no sharing), we could in this case write L6 = [L1[:],L1[:],L1[:]]. In general, may need to write a (possibly recursive) program to deep-clone the data structures in question. IADS Lecture 6 Slide 7 ",
    "6_7": "Equality testing Equality testing can be . . . (cid:73) by reference (‘are the addresses the same?’), or (cid:73) by content (‘is what we find at those addresses “the same”?’) In Python, is means reference eq, == means (deep) content eq. E.g. after commands in column 1, what does column 2 give? L1 = [1,2,3] L2 = L1 L3 = [L1,L1,L1] L4 = L1[:] L5 = L3[:] L6 = [L1[:],L1[:],L1[:]] L2 is L1 L4 is L1 L2 == L1 L4 == L1 L6 is L3 L6 == L3 # True # False # True # True # False # True Warning: In Java, == means reference equality! For content equality, typically use an .equals method. Strings are especially slippery. Use content equality! IADS Lecture 6 Slide 8 ",
    "6_8": "About those NullPointerExceptions Consider a Java expression of form expr .fieldname. E.g. X.age. The expr evaluates to a reference, or perhaps to null. But when we pass the ‘.’, we follow the reference to reach what it points to (dereferencing) . . . and so risk a NullPointerException if value of expr was null! Same goes for the ‘.’ in expr .methodname(arguments). E.g. X.name.length(). Understanding this (and drawing pictures) can go a long way towards rooting out those pesky NullPointerExceptions. IADS Lecture 6 Slide 9 ",
    "6_9": "Basic operations The following operations (among others) may all be assumed to work within constant time (i.e. Θ(1) time): (cid:73) Reading and writing values of program variables (basic or ref type). n n = 341 X Y = X (cid:73) Accessing or updating a field in a given object (involves deref). X.age X.age = 51 X.name = s (cid:73) Accessing or updating an entry in a given array (may involve deref). (cid:73) Allocating a new object (e.g. of a given class) on the heap (not A[42] A[42] = 51 counting initialization of fields). (cid:73) Allocating a new array on the heap, not counting initialization of all X = new Person() its entries. IADS Lecture 6 Slide 10 ",
    "6_10": "Linked lists In Java/Python, Linked list cells would typically be simple objects, e.g. of class Cell, with fields called key, next and maybe prev. E.g. a doubly linked list: In functional languages, singly-linked lists are everywhere, but presentation may look more abstract. E.g. L.key written as L.next written as new Cell(x,L) written as null written as head L tail L cons(x,L) or x:L nil or [] Anyway, find nth element of a linked list L takes time Θ(n). Reading: CLRS chapter 10, especially 10.2 and 10.3. IADS Lecture 6 Slide 11 ",
    "6_11": "IADS Lecture 6 Slide 12 ",
    "6_12": "Music: George Harrison, Here comes the sun Arranged and played by John Longley Photograph: Glen Etive from path to Lairig Gartain Kyriakos Kalorkoti (by kind permission) IADS Lecture 6 Slide 13 ",
    "7_1": "‘Lists’ in general . . . We’ve seen that ‘lists’ can be implemented in several ways, e.g. via arrays or linked lists. How might we compare these? Start by listing the operations we’d like any impl to support. E.g. for (unsorted) lists of items of type X , might want operations get set cons : int → X : int ∗ X → void : X → void append : X → void : int ∗ X → void insert delete : int → void length : void → int Much like an interface in Java. # read item at given pos # write item at given pos # add item at start # add item at end IADS Lecture 7 Slide 2 ",
    "7_2": "Abstract interfaces, concrete implementations As in Java, we can consider various concrete implementations of this abstract interface. Further points: (cid:73) For some purposes, could consider an interface with fewer operations, or with more: e.g. reverse : void → void. (cid:73) May be other operations that make sense for specific impl’s. E.g. for linked lists, ‘insert/delete at current position’ is useful. (cid:73) Some of our operations will be definable from others: e.g. cons(x) ≡ insert(0, x) But may wish to include cons in its own right: might be implementable more efficiently than general insert. IADS Lecture 7 Slide 3 ",
    "7_3": "Implementation 1: Fixed-size arrays Use an array A of some fixed size m. Can store a list L = x0, . . . , xn−1 (where n ≤ m) in the first n cells of A (so A[i] = xi for each i < n). Also want an integer variable n to store the value of n. List operations are easy to implement. E.g. get(i): return A[i] append(x): A[n] = x n = n+1 insert (i,x): for j = n−1 downto i A[j+1] = A[j] A[i] = x n = n+1 (cid:73) length, get, set and append (when it works) take Θ(1) time. (cid:73) cons, insert, delete require Θ(n) time in worst case. IADS Lecture 7 Slide 4 ",
    "7_4": "Lists via fixed-size arrays, ctd. Fixed-size arrays have some strengths . . . (cid:73) Fast get and set operations – especially if we can keep the array on the stack! (cid:73) Fixed, predictable size good for memory management. (If on stack, can reclaim space immediately on expiry.) . . . but a major weakness . . . (cid:73) Can’t cope with lists longer than pre-set limit m! (cid:73) If a computation involves a lot of lists, of unpredictable sizes, very likely we’ll either under-cater (some array will overﬂow) or over-cater (many arrays will contain a lot of wasted space). So not a good choice for ‘general-purpose’ lists. IADS Lecture 7 Slide 5 ",
    "7_5": "Implementation 2: Extensible arrays Idea is simple: if array A overﬂows, replace it by a bigger one! (cid:73) If memory space ‘after’ A happens to be free, cheap to do. (cid:73) But if not, may have to allocate a fresh array B, and copy contents of A into it. E.g. for some real number r > 1: append (x): if n = |A| B = new array ((cid:100) n × r (cid:101)) copy contents of A into B (n items) A = B # Now do ordinary append: A[n] = x n = n+1 So a ‘normal’ append takes Θ(1) time – but occasionally we may get a bad one, taking Θ(n). Might seem ‘dirty’, but widely used in practice. Runtime analysis is interesting . . . IADS Lecture 7 Slide 6 ",
    "7_6": "Amortized cost Perhaps in some apps, even one bad append day could be fatal. But often, we’re happy if over any long run of appends, the average time is reasonable. A bad one may be acceptable if we regard its cost as amortized (‘spread out’) over the next 100 good ones – i.e. if invested eﬀort ‘pays for itself’ over time. Does it? Suppose array has initial capacity a, and starting from nil we do m appends in succession, expanding by factor r > 1 when need be. Array size grows as a, ar , ar 2, ar 3, . . .. How many steps to reach m? Solving ‘ar s = m’ yields s = logr (m/a) for the number of steps. An item may get copied this many times! Since potential number of copyings of an item grows with m, might suspect ‘average cost per append’ also grows with m . . . ?? Let’s do the sums. IADS Lecture 7 Slide 7 ",
    "7_7": "Calculating amortized cost of append Example: Suppose a = 100, r = 1.1, m = 5000. Note that 1.141a < m < 1.142a. So will need 42 expansions. Ignoring ‘rounding’, number of copyings (B[i] = A[i]) is basically 100 × (1 + 1.1 + 1.12 + ··· + 1.141) By ‘sum of geometric progression’ formula, this is 100 × (1.142 − 1)/(1.1 − 1) < 1.1m/0.1 So although some items get copied 42 times, average no. of copyings per item stays below 1.1/0.1 = 11. In general, total number of copyings is basically at most m(r /(r−1)). So average no. of copyings per item stays below r /(r − 1). IADS Lecture 7 Slide 8 ",
    "7_8": "More conceptual argument Again suppose a = 100, r = 1.1. Imagine a copying costs 1p. Each time we do an append, we pay 11p into a pension fund to pay for future copyings. Suppose we’ve just done our first expansion. Array now has 110 cells, with 100 filled. Next 10 appends pay for second expansion (110 copyings). After second expansion, array has 121 cells, 110 filled. Next 11 appends pay for third expansion (121 copyings) . . . So each append incurs a constant cost of 11 copyings. IADS Lecture 7 Slide 9 ",
    "7_9": "Amortized cost: conclusion So total time taken by expansion/copying is O(m). But time taken by ordinary appends is also clearly O(m). So may say the amortized cost of append is O(1) per operation. (cid:73) Lists in Python are implemented like this, essentially with r = 9/8. Underlying arrays may also be shrunk if proportion in use dips below 1/2. (For analysis, see CLRS 17.4.) (cid:73) Java class ArrayList also works like this. Precise expansion policy not prescribed, but it’s required that amortized cost over a long run must be O(1) per operation. Of course, cons, insert, delete still take time Θ(n) in worst case (even amortized). IADS Lecture 7 Slide 10 ",
    "7_10": "Implementation 3: Linked lists We can also represent the lists over X using linked lists, where each cell contains a key of type X . Clearly, for a list of length n: (cid:73) get and set have Θ(n) worst-case time (but with small ‘C ’) (cid:73) cons takes Θ(1) time, always. (cid:73) insert(i,x), delete(i) have Θ(n) worst-case time (or Θ(1) if we’ve already located the cell at position i − 1). Linked lists also naturally allow for sharing (unlike arrays): Oﬄine exercise: Show how the list of all 2n binary lists of length n can be stored in Θ(2n) space with linked list impl. (Would take Θ(n.2n) with arrays.) IADS Lecture 7 Slide 11 ",
    "7_11": "List implementations: summary Upper bounds on runtimes (where n is length of list): Operation Array impl get O(1) set O(1) cons append insert delete O(n) * O(n) * O(n) (amortized O(1)) O(n) (can make it O(1)) * O(n) Linked-list impl O(n) O(n) O(1) O(n) O(n) Operations marked * may fail for fixed-array implementations, or trigger expansion for extensible-array ones. So arrays oﬀer fast get/set; linked lists oﬀer fast cons/append and insert/delete at given position, plus sharing. ?? Is there some impl of lists for which all the above are ‘fast’ ?? Find out in Lecture 9! IADS Lecture 7 Slide 12 ",
    "7_12": "Stacks and queues Sometimes, we know that some list will only be manipulated in certain restricted ways, e.g. . . . (cid:73) Elements only ever added/read/removed at front of list (stack or Last-in-first-out buﬀer) (cid:73) Elements added at back, read/removed at front of list (queue or First-in-first-out buﬀer) Knowing this may aﬀect our choice of implementation. Interfaces for stacks and queues (of items of type X ): STACKS: : void → bool empty push : X → void peek : void → X pop : void → X QUEUES: : void → bool empty enqueue : X → void peek : void → X dequeue : void → X IADS Lecture 7 Slide 13 ",
    "7_13": "Implementing stacks In principle, any impl of lists yields an impl of stacks: But two obvious candidates: (cid:73) arrays (growing at end) (cid:73) linked lists (growing at start) Operation Extensible array impl empty O(1) Linked list impl O(1) * O(n) (amortized O(1)) O(1) O(1) O(1) push peek O(1) pop O(1) IADS Lecture 7 Slide 14 ",
    "7_14": "Implementing queues Impl 1: Wraparound array buﬀer (fixed-size/extensible) Impl 2: Linked list with references to first and last cells IADS Lecture 7 Slide 15 ",
    "7_15": "Implementing queues, ctd. How would e.g. enqueue look in each case? Wraparound array: enqueue(x): j = (j+1) mod |A| if j = i fail (or expand) else A[j] = x Linked list: enqueue(x): last.next = new Cell(x,null) last = last.next For further details, see Python Lab Sheet 3. Situation similar to stacks: Operation Wraparound array impl enqueue Linked-list impl peek O(1) dequeue O(1) * O(n) (amortized O(1)) O(1) O(1) O(1) IADS Lecture 7 Slide 16 ",
    "7_16": "Reading Stacks and queues: CLRS chapter 10. Table expansion / amortized analysis: CLRS section 17.4. IADS Lecture 7 Slide 17 ",
    "8_1": "Sets and dictionaries Two important datatypes . . . (cid:73) (Finite) sets of items of a given type X . E.g. {3, 5} = {5, 3} : X → bool contains : X → void insert delete : X → void : void → bool isEmpty (cid:73) Dictionaries (i.e. lookup tables) mapping keys of type X to values of type Y . lookup : X → Y insert delete : X → void isEmpty : X ∗ Y → void : void → bool IADS Lecture 8 Slide 2 ",
    "8_2": "Sets and dictionaries in Python Beatles = {’John’, ’Paul’, ’George’, ’Ringo’} ’George’ in Beatles # returns True BeatlesYearsOfBirth = {’John’:1940, ’Paul’:1942, ’George’:1943, ’Ringo’:1940} BeatlesYearsOfBirth[’George’] # returns 1943 IADS Lecture 8 Slide 3 ",
    "8_3": "Sets and dictionaries via sorted arrays Could implement sets/dictionaries via (any impl of) lists: Beatles Rep = [’John’, ’Paul’, ’George’, ’Ringo’] BeatlesYearsOfBirth Rep = [(’John’,1940), (’Paul’,1942), ....] But average-case time for contains/lookup will be Θ(n) (terrible!) Much better if arrays are sorted (by key). Can then use binary search. E.g. for dictionaries: binarySearch(A,key,i,j): if j−1 = i # searches A[i], ..., A[j−1] else if A[i].key = key then return A[i].value else FAIL k = (cid:98) i+j/2 (cid:99) if key < A[k].key then return binarySearch(A,key,i,k) else return binarySearch(A,key,k,j) Using this, contains/lookup have worst-case time Θ(lg n). But insert/delete still costly. Can we do better? IADS Lecture 8 Slide 4 ",
    "8_4": "Hash tables Suppose our keys are strings (e.g. people’s names). Number K of potential keys is vast — number n of actual keys ‘currently in use’ much smaller. Really silly idea: Give a way of converting strings s to integers ı(s) (E.g. treat ASCII characters as digits to base 128). Then store value associated with s in a big array at position ı(s). Impractical: K normally far too large, and most of the array would be unused. More sensible idea: Choose some hash function # mapping potential keys s to integers 0, . . . , m − 1 (hash codes), where m ∼ n. Want # to be easy to compute. E.g. we might define: #(s) = ı(s) mod m Then try to use an array A of size m, storing the entry for key s at position #(s) in A. IADS Lecture 8 Slide 5 ",
    "8_5": "Hashes and clashes Problem: What if #(s) = #(t) for two keys s, t? How likely are clashes to arise? E.g. if we took e.g. m ∼ 5n (and accepted the space wastage), would clashes be improbable? Example: Keys are people, m = 366, #(p) = birthday of p. How many people must there be for probability of shared birthday to be > 1/2? (Assume uniform distrib.) Answer: Just 23! (Sometimes called the birthday paradox.) See CLRS 5.4.1 for analysis (if you’re interested). Question: In a class of 347 (assuming uniform distrib), what would be the probability of a birthday shared by 2 people? By 3 people? By 4, 5, 6, 7, . . . ? 2 5 6 7 > (100 − 10−123)% > 99.9999% > 99.8% 66% 15% 2% 3 4 IADS Lecture 8 Slide 6 ",
    "8_6": "The Great Inf2 Birthday Experiment (totally optional!) Curious about shared birthdays? Email j.r.longley@ed.ac.uk to take part! Subject line: birthday MMDD (E.g. birthday 0216 for 16 Feb; birthday 1006 for 6 Oct.) Please observe this format: lowercase birthday then single space. Body text: Your name if you’d like to be put in touch with any others with same birthday. Otherwise blank. Closing date: 12 noon (BST) on Friday 22 October. All emails/records will be deleted by Friday 29 October. I’ll announce the results on Piazza: number of participants, dates of any shared birthdays, and number of people sharing them. I won’t announce any names. IADS Lecture 8 Slide 7 ",
    "8_7": "Dealing with clashes So we must accept clashes (a.k.a. collisions) as a fact of life. Solution 1: Store a list of entries (or bucket) for each hash value. (Omit value components if it’s just a set.) Write n for number of entries, m for array size. The ratio α = n/m is called the load on the hash table: may be ≤ 1 or > 1. If we’ve decided on a desired load α, can ‘expand-and-rehash’ any time n gets too large (amortized cost is reasonable). IADS Lecture 8 Slide 8 ",
    "8_8": "Bucket-list hash tables: some analysis Recall: n table entries, m hash codes, α = n/m. Write bi for number of entries in ith bucket. Let’s analyse average time for an unsuccessful lookup. Assume that for k not in the table, #(k) equally likely to be any of the m hash codes. If #(k) = i, lookup will do bi key comparisons if unsuccessful. So average number of key comparisons is m−1(cid:88) i=0 1 m bi = n/m = α If computing #(k) itself takes O(1) time, conclude that average time for unsuccessful lookup is Θ(α). (Thinking of α → ∞.) Can also show the same for successful lookup, assuming all keys present in table are equally likely. See CLRS 11.2. IADS Lecture 8 Slide 9 ",
    "8_9": "Making a proper hash of it Rarely true that all potential keys (e.g. strings) ‘equally probable’. But in the interests of ‘balancing’ our hash table, we’d like the hash codes 0, . . . , m − 1 to be all equally likely. Bad choice: #(s) = ı(s) mod 128. Eﬀectively just last character of s. So avoid powers of two! Also not great: #(s) = ı(s) mod 127. Gives #(s) = #(t) whenever s, t are anagrams. So #(‘algorithms’) = #(‘logarithms’). Better: #(s) = ı(s) mod 97. Primes not too close to powers of two are reasonable. Just the start of the delicate art of hash function design. . . But whatever we do, worst case (all keys hashing to same code) is always terrible. A malicious user who knew your hash function could force this to happen . . . IADS Lecture 8 Slide 10 ",
    "8_10": "Open addressing and probing Solution 2: Rather than keeping bucket lists outside the hash table, store all items within the table itself (open addressing). To deal with clashes, we use not just a simple hash function #(k), but a function #(k, i) where 0 ≤ i < m. For a key k: (cid:73) #(k, 0) is our first choice of hash value, (cid:73) #(k, 1) is our second choice, etc. so that #(k, 0), #(k, 1), . . . , #(k, m − 1) is a permutation of 0, . . . , m − 1. (Ideally, for a randomly chosen k, all m! permutations should be equally likely.) To insert an item e with key k, probe A[#(k, 0)], A[#(k, 1)], . . . until we find a free slot A[#(k, i)], then put e there. To lookup an item with key k, probe A[#(k, 0)], A[#(k, 1)], . . . until we find either an item with key k, or free cell (lookup failed). IADS Lecture 8 Slide 11 ",
    "8_11": "Probing: example Let’s use an array A of size m = 10 to store a set of integers. 1 2 3 4 5 6 7 0 58 8 28 9 49 Probe function: #(k, i) = (k + i) mod 10. insert(49). #(49, 0) = 9: free. insert(28). #(28, 0) = 8: free. insert(58). #(58, 0) = 8: taken. #(58, 1) = 9: taken. #(58, 2) = 0: free. contains(28). #(28, 0) = 8, A[8] = 28. So true. contains(58). #(58, 0) = 8, A[8] = 28 (cid:54)= 58. #(58, 1) = 9, A[9] = 49 (cid:54)= 58. #(58, 2) = 0: A[0] = 58. So true. contains(39). #(39, 0) = 9, A[9] = 49 (cid:54)= 39. #(39, 1) = 0, A[0] = 58 (cid:54)= 39. #(39, 2) = 1, A[1] free. So false. IADS Lecture 8 Slide 12 ",
    "8_12": "Probing: pros and cons (cid:73) Expected number of probes for insert (and hence for lookup) stays low until table is nearly full. (Can show it’s 1/(1 − α) for unsuccessful lookup; less for successful one.) (cid:73) No need for pointers. The memory this saves can be ‘spent’ on increasing table size m and so decreasing load α . . . So compared to bucket lists, get faster lookup for same amount of memory. (cid:73) However, delete is a pain for the probing approach. (cid:73) Design of probing functions is again a delicate art (linear probing, quadratic probing, double hashing, . . . ). See CLRS 11.4 for more details. IADS Lecture 8 Slide 13 ",
    "8_13": "Radical alternative: Perfect hashing (cid:73) All the approaches we’ve mentioned are bad in the worst case: size of bucket/sequence of probes can be of length n. (cid:73) Even in typical cases, probably some buckets will be large relative to α. (Birthday paradox!) If we could avoid clashes altogether, these problems would vanish! Would get worst-case Θ(1) lookup. If set of keys is static (no insert/delete required), may be worth finding a perfect hash function (no clashes) for this set of keys. As part of Coursework 1, we’ll explore a state-of-the-art approach to perfect hashing. IADS Lecture 8 Slide 14 ",
    "8_14": "Reading: CLRS Chapter 11. You can omit the theorems and their proofs, except for Theorem 11.1 which corresponds to slide 9. Today’s music: Nikolai Rimsky-Korsakov, Flight of the bumblebee. (Piano version by Sergei Rachmaninov.) IADS Lecture 8 Slide 15 ",
    "9_1": "Tackling that ‘worst case’ (cid:73) We’ve considered hash table implementations of sets/dictionaries in which lookup/insert/delete are usually fast – but worst case time for all operations is Θ(n). (cid:73) For lists (a.k.a. vectors): some operations have worst-case time Θ(1), but insert/delete are Θ(n) even in average case. ??? Can we find implementations of sets/dictionaries/lists for which all operations have acceptable worst-case times ??? This lecture: We’ll see that ‘balanced trees’ (e.g. red-black trees) achieve this: all ops have worst-case and average time Θ(lg n). Will do sets/dictionaries here; ideas can also be applied to lists. IADS Lecture 9 Slide 2 ",
    "9_2": "Representing sets by trees Consider binary trees: each node x has a left and a right branch, each of which may be null or a pointer to a child node. (Implementation detail: should use doubly linked tree structures.) Write L(x), R(x) for left and right subtrees at x (may be empty). Label nodes with keys (e.g. integers or strings) in such a way that for every node x we have ∀y ∈ L(x). y .key < x.key , ∀z ∈ R(x). x.key < z.key Can use such trees to represent sets of keys. (For dictionaries, just add value component to each node.) IADS Lecture 9 Slide 3 ",
    "9_3": "Implementing contains/lookup This is easy. Let a node x stand for the tree rooted at x. contains’(x,k): if x = null then return False else if x.key = k then return True else if k < x.key then return contains’(x.left,k) else return contains’(x.right,k) contains(k): return contains’(root,k) Suppose the tree has n nodes and is perfectly balanced, i.e. all non-leaf nodes have 2 children, and all leaf nodes are at the same depth d. (Possible only if n = 2d+1 − 1.) Then d = (cid:98)lg n(cid:99), so contains will take time O(lg n). More generally, for trees that are ‘not too unbalanced’ (say max depth ≤ 2(cid:100)lg n(cid:101)), can say contains take O(lg n) time. However, worst case is still Θ(n)! IADS Lecture 9 Slide 4 ",
    "9_4": "Insert on binary trees This too is easy: walk down tree to find where k wants to go, and create a new leaf node for it. insert’(x,k): if x.key = k then return KeyAlreadyPresent else if k < x.key then if x.left = null then x.left = new Node(k) else insert’(x.left,k) else if x.right = null then x.right = new Node(k) else insert’(x.right,k) insert(k): if root = null then root = new Node(k) else return insert’(root,k) Again, O(lg n) time if tree not too unbalanced, Θ(n) in worst case. NB. Nothing here to guard against tree becoming unbalanced! IADS Lecture 9 Slide 5 ",
    "9_5": "Delete on binary trees A bit more subtle. To perform delete(j): (cid:73) Locate the node y bearing j (assume there is one). (cid:73) If y has no children, can just delete it. (cid:73) If y has one child, easy to elide the node y (Fig. 1). (cid:73) If y has two children: (cid:73) Locate leftmost node in R(y ), i.e. starting at y , turn right, then left as often as possible. This finds the node z bearing the smallest key in R(y ) (call it k). (cid:73) Copy z.key to y .key. (cid:73) If z has a right child, elide z, otherwise just delete z. (Fig. 2). Same runtime characteristics. IADS Lecture 9 Slide 6 ",
    "9_6": "Balanced tree representations General strategy: (cid:73) Work with some special class of trees (red-black trees) that are guaranteed to be ‘not too unbalanced’, so that all operations will take time O(lg n). (cid:73) Whenever an insert/delete threatens to take us outside this class, do some ‘re-balancing’ work to restore it. Clever bit: Can arrange that this re-balancing work also takes just O(lg n) time! This leads to worst-case O(lg n) time for all operations. This broad strategy works for several classes of trees: red-black trees, AVL trees, 2-3 trees, . . . We choose red-black trees as they’re covered in detail in CLRS. IADS Lecture 9 Slide 7 ",
    "9_7": "Small preliminary: adding trivial nodes For mathematical convenience, extend our trees so that original null branches now point to trivial nodes, with no children and bearing no key. Original nodes are proper nodes. Call this an extended tree. Just makes rules easier to state. Wouldn’t need these trivial nodes in an implementation. IADS Lecture 9 Slide 8 ",
    "9_8": "Red-black trees Work with extended trees as above. In a red-black tree, every node is coloured red or black. Tree rules: (cid:73) Root and all (trivial) leaves are black. (cid:73) All paths root → leaf contain same number b of blacks. (cid:73) On a path root → leaf, never have two reds in a row. So min possible path length is b, and max is 2b − 1. Red-black trees are not too unbalanced: Can show b ≤ lg(n + 1) + 1, so all path lengths ≤ 2 lg(n + 1) + 1. So contains works as usual with worst-case time Θ(lg n). IADS Lecture 9 Slide 9 ",
    "9_9": "Insert for red-black trees Can insert a key-bearing node as usual (adding two trivial leaves). Colour it red. This all takes O(lg n) time. Problem: Resulting tree might no longer be a legal red-black tree: (cid:73) New red node might have red parent (2 reds in succession), or (cid:73) (Trivial case) New red node might be root (should be black). So need to apply a fix-up operation to restore red-black-ness. Main ingredient is the red-uncle rule: (Just colour-ﬂipping: fast. No rewiring involved!) IADS Lecture 9 Slide 10 ",
    "9_10": "Insert fix-up, continued Applying the red-uncle rule pushes a red upward, so may result in another double-red higher up. So we apply the red-uncle rule as often as possible (will be at most O(lg n) times). We’ll then be in one of three endgame scenarios: 1. Problem cured: tree now legal. 2. Red pushed to root: turn it black. Adds 1 to all black-lengths. 3. Have some configuration involving a black with 4 ‘nearest black descendants’. Replace by obvious ‘balanced’ version: =⇒ O(1) amount of rewiring. Note order of constituents is preserved: AaBbCcD. (Subtrees A,B,C,D may be empty.) IADS Lecture 9 Slide 11 ",
    "9_11": "Delete for red-black trees Just the main ideas: won’t give full details. Do delete as usual: this involves removing some proper node z. Problem: All paths must have same black-length. So if z was black, want to remove z but keep the ‘blackness’. Easy case: Node it haunts is now red: can just turn it black. Wandering black rule: apply this as often as possible (will be O(lg n) times). IADS Lecture 9 Slide 12 ",
    "9_12": "Delete for red-black trees: the endgame Finitely many endgame scenarios, each fixable in O(1) time. E.g. (cid:73) Floating black haunts a red node: turns it black. (cid:73) Floating black reaches root: just remove it. (cid:73) We’re in some other fixable scenario, e.g. Blue square and green triangle are colour variables. (cid:73) 4 other scenarios like this: see CLRS 13 for full details. IADS Lecture 9 Slide 13 ",
    "9_13": "Balanced trees: conclusion (cid:73) Balanced trees oﬀer a way of implementing sets/dictionaries so that all operations have worst-case time O(lg n). (Idea can be applied to lists too.) (cid:73) Not much to choose between red-black and AVL trees. AVL are ‘more balanced’ (better for lookup); red-blacks possibly have faster insert/delete. (cid:73) Red-black trees used in practice: (cid:73) Linux completely fair scheduler (cid:73) Java 8 HashMap class: dictionary via bucket-style hash table, but each bucket is a red-black tree rather than a linked list. Retains excellent typical-case performance of hash tables, but kills oﬀ the nasty ‘worst cases’. Reading: CLRS 12.1-12.3, 13.1-13.3 Today’s music: John Williams, Hedwig’s Theme (from the Harry Potter films). IADS Lecture 9 Slide 14 ",
    "10_1": "Data structures: reﬂection We’ve looked at . . . (cid:73) some classic abstract datatypes (lists, stacks, queues, sets, (cid:73) various concrete implementations of them (via extensible dictionaries) arrays, linked lists, hash tables, red-black trees . . . ) We’ve analysed their pros/cons in terms of asymptotic runtimes for operations. (Measured as number of line executions, paying attention to what’s allowed as a Θ(1) time basic memory operation.) The above datatypes are used frequently in programming – and many other algorithms build on them. Most of these data structures already provided in standard libraries (e.g. Java API classes). But understanding of runtime characteristics can help in (cid:73) writing efficient programs (cid:73) constructing efficient database queries. IADS Lecture 10 Slide 2 ",
    "10_2": "Recursion: a recurring theme As we’ve seen, many algorithms can be presented as recursive: i.e. they involve subcall to (one or more instances of) same problem. Examples: (cid:73) Expmod(a,n,m) involves call to Expmod(a,(cid:98)n/2(cid:99),m). (cid:73) Mergesort(A,m,n) calls Mergesort(A,m,p) and Mergesort(A,p,n). (cid:73) Insert(x,k) (for binary trees) may call Insert(x.left,k) or Insert(x.right,k). Common pattern: (cid:73) ‘Simple’ (e.g. small) instances can be dealt with directly. (cid:73) For larger instances, may do work before/during/after the recursive call(s): we divide into subproblems, conquer these, combine results. E.g. for Mergesort: (cid:73) divide is simply checking n − m > 1 and computing (cid:98)(m + n)/2(cid:99). (cid:73) combine is merging the two lists returned by the recursive calls. IADS Lecture 10 Slide 3 ",
    "10_3": "Recurrence relations How can we calculate the (asymptotic) runtime for a recursive algorithm? Let T (n) be the worst-case runtime e.g. for Mergesort on array segments of size n. Whatever the function T is, can say that T (n) = T ((cid:98)n/2(cid:99)) + T ((cid:100)n/2(cid:101)) + F (n) for all n > 1 , where F (n) is the worst-case time for the divide and combine phases on inputs of size n. Can also say T (1) is a constant C . This is an example of a recurrence relation. If we know C and F , can compute T (n) for a specific n, e.g. T (4) = 2T (2) + F (4) = 2(2T (1) + F (2)) + F (4) = 4C + 2F (2) + F (4) But can we ‘solve’ the rec. rel. to find an explicit formula for T (n)? Or at least, for its asymptotic growth rate? IADS Lecture 10 Slide 4 ",
    "10_4": "Recurrence relations for growth rates (cid:26) C T (n) = if n = 1 T ((cid:98)n/2(cid:99)) + T ((cid:100)n/2(cid:101)) + F (n) otherwise Actually, if we only want the growth rate of T , don’t need to know F precisely — knowing its growth rate is enough. E.g. in Mergesort example, have F (n) = Θ(n) (time for Merge on lists of length n/2). Leads to the concept of an asymptotic recurrence relation. E.g. (cid:26) Θ(1) T (n) = 2T (n/2) + Θ(n) otherwise if n = 1 Solution we’re seeking isn’t a precise function, but a growth rate. (Omission of (cid:98)−(cid:99) and (cid:100)−(cid:101) a bit sloppy . . . but can be shown these ‘don’t aﬀect asymptotic solution’ in cases like this.) IADS Lecture 10 Slide 5 ",
    "10_5": "Recurrence relations ctd. Asymp. rec. relation for Mergesort again: (cid:26) Θ(1) T (n) = 2T (n/2) + Θ(n) otherwise if n = 1 In Lecture 5 we saw informally that in this case T (n) = Θ(n lg n). Other examples: (cid:73) Runtime of Expmod(a,n,m) for fixed a,m: T (n) = T (n/2) + Θ(1) for n>1 (cid:73) Runtime of Exp(a,n) for fixed a (Expmod without the mod): T (n) = T (n/2) + Θ(n2) for n>1 (cid:63) Can we solve such recurrences systematically? Is there a general pattern here? IADS Lecture 10 Slide 6 ",
    "10_6": "How do we come up with solutions? Approach 1: Use intuition/experience/numerical data to ‘guess’ a solution, then verify it using induction. Usual concept of induction needs extending a bit. We’ll use MergeSort as an example. Ordinary induction: ‘Log induction’: Here, log induction on k (cid:39) ordinary induction on (cid:100)lg k(cid:101) (recursion depth for MergeSort on array segments of size k). IADS Lecture 10 Slide 7 ",
    "10_7": "Proof by induction on recursion depth Claim: If n − m = k ≥ 1, number of comparisons performed by MergeSort (A,m,n) is ≤ k(cid:100)lg k(cid:101). Proof by complete induction on (cid:100)lg k(cid:101): Base case: (cid:100)lg k(cid:101) = 0, i.e. k = 1. Then MergeSort immediately returns [A(m)] (0 comparisons). Induction step: Suppose claim holds whenever (cid:100)lg k(cid:101) ≤ q, and now consider some k such that (cid:100)lg k(cid:101) = q + 1. Let p = (cid:98)(m + n)/2(cid:99), k1 = p − m, k2 = n − p. (So either k1 = k2 = k/2 or k1 = (cid:98)k/2(cid:99), k2 = (cid:100)k/2(cid:101).) In any case, we have (cid:100)lg(k1)(cid:101),(cid:100)lg(k2)(cid:101) ≤ q. So by induction hypothesis: (cid:73) MergeSort (A, m, p) takes ≤ k1(cid:100)lg(k1)(cid:101) ≤ k1q comparisons, (cid:73) MergeSort (A, p, n) takes ≤ k2(cid:100)lg(k2)(cid:101) ≤ k2q comparisons, (cid:73) the final Merge (B, C ) takes ≤ k1 + k2 = k comparisons. So total number of comparisons is ≤ k1q + k2q + k = kq + k = k(q + 1) = k(cid:100)lg k(cid:101) as required. (cid:3) IADS Lecture 10 Slide 8 ",
    "10_8": "The Master Theorem Approach 2: If our recurrence happens to be of the form . . . (cid:26) Θ(1) T (n) = aT (n/b) + Θ(nk ) if n ≤ n0 if n > n0 . . . then there’s a Master Theorem that simply gives us the answer. (Also works with ‘ﬂoors and ceilings’ around.) The answer depends on how a compares with bk (will explain!). Equivalently, how e = logb a compares with k.  Θ(ne) Θ(nk lg n) Θ(nk ) if e > k if e = k if e < k T (n) = This applies in many (not all) commonly arising situations. (CLRS 4.5 gives a more general version of the theorem.) IADS Lecture 10 Slide 9 ",
    "10_9": "Master Theorem: informal intuition Think about total work done by all divide / combine phases at each recursion level. Does this increase or decrease as we go down? (cid:73) Larger a (no. of subproblems) means more work as we descend. (cid:73) But larger b means each subproblem is smaller. If divide/combine work is F (n) = Θ(nk ), then reducing problem size by factor b will reduce this work by bk . (cid:73) So break-even point is when a = bk . In this case, amount of work is ‘essentially the same’ for all levels. IADS Lecture 10 Slide 10 ",
    "10_10": "Optional slide (not covered in video lecture) A bit more detail for those interested . . . (cid:73) If a < bk , then the most work is done at the top level. Thereafter, amount of work roughly decreases in geometric progression, by factor r = a/bk < 1. So total work will be roughly top-level work (Θ(nk )) times 1 + r + r 2 + ··· ≤ 1/(1 − r ) (constant). Still Θ(nk ). (cid:73) If a > bk , work increases by r = a/bk > 1 as we descend. Around logb(n) levels. So bottom-level exceeds top-level by r logb(n) = blogb(r ). logb(n) = blogb(n). logb(a/bk ) = ne−k So total work comes out as Θ(nk ).Θ(ne−k ) = Θ(ne). (cid:73) If a = bk , all levels are ‘essentially the same’. So work is roughly (top-level work × number of levels), i.e. Θ(nk lg n). IADS Lecture 10 Slide 11 ",
    "10_11": "Master Theorem in action (cid:73) Mergesort recurrence again: (cid:26) Θ(1) T (n) = 2T (n/2) + Θ(n) otherwise if n = 1 Here a = 2, b = 2, k = 1. So e = logb a = 1 and e = k. So we’re in the middle case: Θ(n log n). (cid:73) Exp(a,n) for fixed a: T (n) = T (n/2) + Θ(n2) if n>1 Here a = 1, b = 2, k = 2. So e = logb a = 0 and e < k. Work at top-level dominates: solution is Θ(n2). More examples coming in Tutorial Sheet 4 (for Week 8). Reading: CLRS Chapter 4 intro and 4.3–4.5. Today’s music: Trad. spiritual, This little light of mine IADS Lecture 10 Slide 12 ",
    "10_12": "Roundup of sorting algorithms For long lists, Insertsort and Bubblesort aren’t serious contenders: both take Θ(n2) time on average. Mergesort Average-case time Θ(n lg n) Worst-case time Θ(n lg n) Heapsort Θ(n lg n) Θ(n lg n) Best-case time Θ(n lg n) Θ(n) (when input Quicksort Θ(n lg n) Θ(n2) Θ(n lg n) already sorted) Hidden constants Extra space needed Stable? Memory locality medium large? small Θ(n) Yes ok? Θ(1) (in-place) Θ(1) (in-place) No poor No good Theorem: Any general, comparison-based sorting algorithm has worst-case time Ω(n lg n). [Proved in CLRS 8.1: boils down to lg(n!) = Ω(n lg n).] However, Countsort, Radixsort, Bucketsort run in O(n) time on more specialized kinds of inputs. [CLRS 8.2, 8.3, 8.4] IADS Lecture 10 Slide 13 ",
    "11_1": "Remainder of semester 1 Hello everyone! I will take over the teaching for the remainder of semester 1, and also a large part of semester 2. Plan for (rest of) semester 1: 11. The Heap data structure 12. BuildHeap and HeapSort: running-time 13. QuickSort 14. Graphs I: graph data structures, Breadth-first search 15. Graphs II: DFS, connected components,TopSort",
    "11_2": "The Heap Definition A (max) heap is a “nearly complete” binary tree structure storing items in nodes, where every node is greater than or equal to each of its child nodes. (cid:73) The rule for parent/child key values is weaker over the tree as a whole than what we have for red-black trees, 2-3-4 trees or AVL trees (in those cases the tree encodes a total-ordering on the keys in the nodes). (cid:73) But . . . the topology of a heap is more restricted than for those other tree structures - we have a binary tree with leaves appearing at depth h and depth h − 1, and all depth-h leaves grouped together to the left. (cid:73) The heap does not (readily) carry total-order information, but is ideally set-up to efficiently answer “max” questions (suitable for priority queues). (cid:73) Neat structure of the topology means we can store the heap in an array.",
    "11_3": "Example heap Direct mapping: k-th element of heap stored in index k − 1. Can use (2i − 1) + j − 1 for index of jth element on level i. (depends on “Almost-complete” property).",
    "11_4": "Heaps: height and size A heap is an almost-complete binary tree: (cid:73) All leaves are either at depth h − 1 or depth h (where h is height). (cid:73) The depth-h leaves all appear consecutively from left-to-right. . . . A heap of height h has between 2h and 2h+1 − 1 nodes. 2h ≤ n ≤ 2h+1 − 1. Hence taking lg across this inequality, we see h ≤ lg(n) < h + 1. This will put h in the range [lg(n) − 1, lg(n)], ie Θ(lg(n)). Lots of our Heap algorithms have worst-case running-time directly related to the height of the Heap.",
    "11_5": "Main operations on a Heap We imagine that the heap is stored in the array A. Heap-Maximum Returns the max element of a Heap - Θ(1) time. Max-Heapify Runs in O(lg(n)) time and is used to maintain the (max) Heap property whenever some node/index i has violated the heap rule (but left subtree, right subtree are each legal Max Heaps). Heap-Extract-Max Can return (and delete) the maximum item of a Heap in O(lg(n)) time. Max-Heap-Insert Can insert a new item (and maintain the heap property) in O(lg(n)) time. Same for Heap-Increase-Key. Build-Max-Heap Special one called Build-Max-Heap will run in O(n) time to build a Heap from scratch from an unordered input array.",
    "11_6": "Max-Heapify and the other operations The Max-Heapify operation (called at i) is used to “fix-up” a Heap where the left-subtree Left(i) is a Heap, and so is the right-subtree Right(i) . . . but the value at i violates the Heap property. (cid:73) We will show that Max-Heapify can be implemented in time O(h) for the height h of the heap, which is O(lg(n)). (well, specifically, the height of the Heap rooted at i) (cid:73) We can then implement Heap-Extract-Max via the trick of just . . . (cid:73) Swapping A[0] (the max element) with A[A.heap size − 1] (the last (cid:73) Then calling Max-Heapify(0) on the Heap to “fix” the error at the item in the array, and decrementing A.heap size. root. (cid:73) Max-Heapify is also key to the implementation of Build-Max-Heap.",
    "11_7": "Heap-Extract-Max The main work is not returning the max element (Θ(1) time) but removing the max from the tree. We copy over the “last node” onto the root, then call Max-Heapify to fix things.",
    "11_8": "Max-Heapify We assume that the “left-heap” Left(i) and the “right-heap” Left(i) are both accurate. Then Max-Heapify(i) will “patch-up” the heap from i. Algorithm Max-Heapify(A, i) (cid:96)← Left(i) r ← Right(i) largest← i largest← (cid:96) largest← r if largest (cid:54)= i 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. if (cid:96) < A.heap size and A[(cid:96)] > A[i] if r < A.heap size and A[r ] > A[largest] exchange A[i] with A[largest] Max-Heapify(A, largest)",
    "11_9": "Max-Heapify We are calling Max-Heapify from the root node. Max child of root is 48 on right, need to swap, and then recursively call Max-Heapify on 30 as the child (as in line 10. of the Algorithm).",
    "11_10": "Max-Heapify . . . Max child of 30 is 45 on left, need to swap, and then call heapify on 30 as the child.",
    "11_11": "Max-Heapify . . . Max child of 30 is 4, less than 30. ok. Finish.",
    "11_12": "Max-Heap-Insert Algorithm Max-Heap-Insert(A, k) 1. A.heap size← A.heap size + 1 2. A[heap size − 1]← k. j← heap size − 1 j← Parent(j) 3. 4. while (j (cid:54)= 0 and A[j] > A[Parent(j)]) do 5. 6. exchange A[j] and A[Parent(j)] “Bubble” the item up the tree. Basically swap k with A[Parent(j)] if k is bigger. Why is this correct?? Takes Θ(1) for adding new last node (initially), and Θ(1) for every swap. Hence Θ(lg n) worst-case in total.",
    "11_13": "Max-Heap-Insert Max-Heap-Insert(48), first add at “last node”. Need to swap 48 with parent 30, because 48 > 30.",
    "11_14": "Max-Heap-Insert 48 has now moved-up Now need to swap 48 with parent 45, because 48 > 45.",
    "11_15": "Max-Heap-Insert Done. 48 is less than root 88, no swap needed.",
    "11_16": "Priority Queues A Priority queue is a Data Structure for storing collections of elements. They diﬀer in their access policy compared to Lists, Stacks and Queues: (cid:73) Every element is associated with a key, which is taken from some linearly ordered set, such as the integers. (cid:73) Keys represent priorities: A larger key means a higher priority. Classic application is for access to resources like printers, when diﬀerent users may have varying priority levels.",
    "11_17": "Priority Queue operations Methods of PriorityQueue: (cid:73) insertItem(k, e): Insert element e with key k. (cid:73) maxElement(): Return an element with maximum key; an error occurs if the priority queue is empty. (cid:73) removeMax(): Return and remove an element with maximum key; an error occurs if the priority queue is empty. (cid:73) isEmpty(): Return true if the priority queue is empty and false otherwise. No findElement(k) or removeItem(k) methods.",
    "11_18": "Implementations of Priority Queues Observation: The maximum key in a binary search tree (like a Red-Black tree) is always stored in the rightmost leaf. Therefore, all Priority Queue methods can be implemented on an Red-Black tree with running time Θ(lg(n)) (except isEmpty which is Θ(1)). However, using a Max Heap we can implement maxElement with Heap-Maximum in Θ(1) time, while still having insertItem (via Max-Heap-Insert) and removeMax (via Heap-Extract-Max) in Θ(lg(n)) time. Note Balanced Search trees can be “tweaked” to maintain a direct pointer to the rightmost leaf, to give Θ(1) for maxElement.",
    "11_19": "Reading Material This lecture used content from sections 6.1, 6.2 and 6.3 of [CLRS]: (cid:73) I did Max-Heap-Insert more directly than the book. (cid:73) I didn’t write the details of Parent, Left, Right on slides (tutorial qn). In lecture 12, I will cover: (cid:73) The method Build-Heap (cid:73) The asymptotic analysis of the running-time of the Heap algorithms (6.1-6.3 of [CLRS]) (cid:73) Heapsort and its running time (6.4 of [CLRS])",
    "13_1": "Holyrood Park last year IADS – Lecture 13 – slide 2 ",
    "13_2": "QuickSort Invented by British computer scientist Tony Hoare in 1960 while studying in Moscow, published in 1961. Divide-and-Conquer algorithm: 1. If the input array has < two elements, do nothing. Otherwise, call Partition: Pick a pivot key and use it to divide the array into two: ≤ pivot pivot ≥ pivot 2. Sort the two subarrays recursively. IADS – Lecture 13 – slide 3 ",
    "13_3": "QuickSort if p < r then split← Partition(A, p, r ) Algorithm QuickSort(A, p, r ) 1. 2. 3. 4. QuickSort(A, p, split − 1) QuickSort(A, split + 1, r ) IADS – Lecture 13 – slide 4 ",
    "13_4": "Partition Algorithm Partition(A, p, r ) 1. pivot← A[r ].key i ← p − 1 for j← p to r − 1 do i ← i + 1 2. 3. 4. 5. 6. 7. exchange A[i + 1] and A[r ] 8. return i + 1 if A[j] ≤ pivot exchange A[i] and A[j] Invariant: i is 1 less than the leftmost > pivot value in the range p . . . j (or is j − 1 if no > pivot is there). IADS – Lecture 13 – slide 5 ",
    "13_5": "Partition example (done on video) IADS – Lecture 13 – slide 6 ",
    "13_6": "Correctness of Partition Assume we are part-way through Partition and for this j (and this i), we have the Invariant (all A[i + 1 . . . j − 1] are > pivot). (cid:73) If A[j].key > pivot, the algorithm changes nothing. Induction step: And the range of > pivot cells expands by 1 (as j gets incremented). (cid:73) If A[j].key ≤ pivot, we will swap A[j] with A[i + 1]. A[i + 1].key either . . . (cid:73) was ≤ pivot (and i = j − 1), in which case i (cid:48) = i + 1 is j and we swap A[j] with itself, and then have the same pattern after j increments, or (cid:73) was > pivot, in which case . . . (cid:73) After loop, Invariant implies that the first > pivot (if any) is in A[i + 1]. Hence swapping A[r ] and A[i + 1] gives a “partition” of the desired form. IADS – Lecture 13 – slide 7 ",
    "13_7": "Results from Partition (cid:73) We might get a fairly balanced partition, with “pivot” lying near the middle (“split” roughly halfway between p and r ). (cid:73) When this happens, the Divide-and-Conquer balance is like MergeSort (and also, we have Θ(n) work at the “top level”) (cid:73) Alternatively, we could get a very unbalanced partition, with one side empty or very small (cid:73) Then we are doing linear work to reduce the size of the problem to be solved only a tiny bit. More like BubbleSort. (cid:73) Or anything in between, depends on the original arrangement of keys (and what “rank” pivot has among the keys in the array). IADS – Lecture 13 – slide 8 ",
    "13_8": "Running Time of QuickSort Tpartition(n) = Θ(n) Partition QuickSort TquickSort(n) ∈ = max1≤s≤n−1 Implies max1≤s≤n−1 + Tpartition(n) + Θ(1) (cid:0)TquickSort(s) + TquickSort(n − s − 1)(cid:1) (cid:0)TquickSort(s) + TquickSort(n − s − 1)(cid:1) + Θ(n). TquickSort(n) ∈ Θ(n2) To show Ω(n2) you need a specific structured input (not too hard). IADS – Lecture 13 – slide 9 ",
    "13_9": "QuickSort The average-case running-time of a sorting algorithm is the average number of computational steps (comparisons) carried out on a uniform random permutation of the keys {1, . . . , n}. (cid:73) We don’t say “amortized” as we have a single computation, and are comparing input of exactly the same size. (cid:73) For sorting-algorithms, typically the running-time can be captured by the number of “comparisons” (these measures tend to be asymptotically equivalent). (cid:73) Uniform random permutation means all permutations arise with same probability. The average-case running time of QuickSort is Θ(n lg(n)). IADS – Lecture 13 – slide 10 ",
    "13_10": "QuickSort (cid:73) QuickSort can be very fast in practice. (cid:73) But performs badly — Θ(n2) — on sorted and almost sorted arrays. Practical Improvements (cid:73) Diﬀerent choice of pivot (key of middle item, random) (cid:73) Refined partitioning routine (cid:73) Use InsertionSort for small arrays (similar to “TimSort”) RandomQuickSort (cid:73) The Θ(n lg(n)) result for average-case can be shown to carry over characterize (expected) running-time for RandomQuickSort (choose the pivot randomly). IADS – Lecture 13 – slide 11 ",
    "13_11": "Sorting in Python The default sorting algorithm in python is “Timsort”, an optimized version of MergeSort developed by Tim Peters, a major contributor to the development of CPython. (cid:73) Does a pre-processing step looking for “runs” of strictly decreasing or (non-strict) increasing items. (cid:73) We understand how to handle “runs” (without sorting). (cid:73) Then merge the sorted runs, using InsertSort for short subarrays, and MergeSort for bigger subarrays. IADS – Lecture 13 – slide 12 ",
    "13_12": "Reading Material Personal Reading: (cid:73) QuickSort and its analysis, sections 7.1, 7.2 and 7.4 of [CLRS] (cid:73) “QuickShort” interview with Tony Hoare can be viewed at http://anothercasualcoder.blogspot.com/2015/03/ my-quickshort-interview-with-sir-tony.html (cid:73) To read about “Timsort” . . . read the listsort.txt file in the Objects directory from the python download. Source code (eg version 3.7.4) can be downloaded https://www.python.org/downloads/source/ IADS – Lecture 13 – slide 13 ",
    "14_1": "Directed and Undirected Graphs (cid:73) A graph is a mathematical structure consisting of a set of vertices and a set of edges connecting the vertices. Formally: G = (V , E ), where V is a set and E ⊆ V × V . (cid:73) G = (V , E ) undirected if for all v , w ∈ V : (v , w ) ∈ E ⇐⇒ (w , v ) ∈ E . Otherwise directed. Directed ∼ arrows (one-way) Undirected ∼ lines (two-way) IADS – Lecture 14 – slide 2 ",
    "14_2": "A directed graph (cid:9) (cid:8) (cid:8) G = (V , E ) with vertex set V = 0, 1, 2, 3, 4, 5, 6 and edge set E = (0, 2), (0, 4), (0, 5), (1, 0), (2, 1), (2, 5), (3, 1), (3, 6), (4, 0), (4, 5), (6, 3), (6, 5) . (cid:9) IADS – Lecture 14 – slide 3 0236541",
    "14_3": "An undirected graph IADS – Lecture 14 – slide 4 badefgc",
    "14_4": "Examples of graphs in “real life” Road Maps. Edges represent streets and vertices represent crossings. IADS – Lecture 14 – slide 5 ",
    "14_5": "Examples (cont’d) Computer Networks. Vertices represent computers and edges represent network connections (cables) between them. The World Wide Web. Vertices represent webpages, and edges represent hyperlinks. IADS – Lecture 14 – slide 6 ",
    "14_6": "Adjacency matrices Let G = (V , E ) be a graph with n vertices, with vertices numbered 0, . . . , n − 1. The adjacency matrix of G is the n × n matrix A = (aij )0≤i ,j≤n−1 with (cid:14) aij = 1 if there is an edge from vertex i to vertex j 0 otherwise. Python arrays are a bit strange to work with, being set up as “lists of lists”. Alternatives are: (cid:73) Import NumPy, and use their true 2D arrays (cid:73) Define a mapping (i , j)→ i ∗ n + j (where n is the number of vertices) and work with a n ∗ n or n ∗ (n + 1)/2 sized 1D array in python. IADS – Lecture 14 – slide 7 ",
    "14_7": "Adjacency matrix (Example)  0 0 1 0 0 1 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 1 0 1 0 1 0 1  0 0 0 1 0 0 0 IADS – Lecture 14 – slide 8 0236541",
    "14_8": "Adjacency lists Array with one entry for each vertex v , which is a list of all vertices adjacent to v . Example IADS – Lecture 14 – slide 9 02365412455103550610125634",
    "14_9": "Lists or matrices? Given: graph G = (V , E ), with n = |V |, m = |E |. For v ∈ V , we write in(v ) for in-degree, out(v ) for out-degree. Questions to think about:? 1. Which data structure has faster (asymptotic) worst-case running-time, for checking if w is adjacent to v , for a given pair of vertices? 2. Which data structure has faster (asymptotic) worst-case running-time, for visiting all vertices w adjacent to v , for a given vertex v ? IADS – Lecture 14 – slide 10 ",
    "14_10": "Adjacency Matrices vs Adjacency Lists adjacency matrix adjacency list Space Θ(n2) Θ(n + m) Time to check if w adjacent to v Time to visit all w adjacent to v . Θ(1) Θ(out(v )) Θ(n) Θ(out(v )) Time to visit all edges Θ(n2) Θ(n + m) IADS – Lecture 14 – slide 11 ",
    "14_11": "Sparse and dense graphs G = (V , E ) graph with n vertices and m edges Observation: m ≤ n2 (cid:73) G dense if m close to n2 (cid:73) G sparse if m much smaller than n2 What about planar graphs? “Kuratowski’s criterion” for Planar graphs has the Corollary that |E | ≤ 3|V | − 6. IADS – Lecture 14 – slide 12 ",
    "14_12": "Graph traversals A traversal is a strategy for visiting all vertices of a graph. BFS = breadth-first search DFS = depth-first search General strategy: 1. Let v be an arbitrary vertex 2. Visit all vertices reachable from v 3. If there are vertices that have not been visited, let v be such a vertex and go back to 2. IADS – Lecture 14 – slide 13 ",
    "14_13": "BFS Visit all vertices reachable from v in the following order: (cid:73) v (cid:73) all neighbours of v (cid:73) all neighbours of neighbours of v that have not been visited yet (cid:73) all neighbours of neighbours of neighbours of v that have not been visited yet (cid:73) etc. IADS – Lecture 14 – slide 14 ",
    "14_14": "BFS (using a Queue) Algorithm bfs(G ) 1. 2. 3. 4. 5. Initialise Boolean array visited , setting all entries to false. Initialise Queue Q for all v ∈ V do if visited [v ] = false then bfsFromVertex(G , v ) IADS – Lecture 14 – slide 15 ",
    "14_15": "BFS (using a Queue) Algorithm bfsFromVertex(G , v ) u← Q.dequeue() 1. visited [v ] = true 2. Q.enqueue(v ) 3. while not Q.isEmpty() do 4. 5. 6. 7. 8. visited [w ] = true Q.enqueue(w ) for all w adjacent to u do if visited [w ] = false then IADS – Lecture 14 – slide 16 ",
    "14_16": "Example for Breadth-First Search The video recording shows a demonstration of bfs on the graph below: IADS – Lecture 14 – slide 17 ",
    "14_17": "DFS Visit all vertices reachable from v in the following order: (cid:73) v (cid:73) some neighbor w of v that has not been visited yet (cid:73) some neighbor x of w that has not been visited yet (cid:73) etc., until the current vertex has no neighbour that has not been visited yet (cid:73) Backtrack to the first vertex that has a yet unvisited neighbour v (cid:48). (cid:73) Continue with v (cid:48), a neighbour, a neighbour of the neighbour, etc., backtrack, etc. IADS – Lecture 14 – slide 18 ",
    "14_18": "DFS (using a stack) Algorithm dfs(G ) 1. 2. 3. 4. 5. Initialise Boolean array visited , setting all to false Initialise Stack S for all v ∈ V do if visited [v ] = false then dfsFromVertex(G , v ) IADS – Lecture 14 – slide 19 ",
    "14_19": "DFS (using a stack) Algorithm dfsFromVertex(G , v ) u← S.pop() 1. S.push(v ) 2. while not S.isEmpty() do 3. 4. 5. 6. 7. if visited [u] = false then visited [u] = true for all w adjacent to u do S.push(w ) IADS – Lecture 14 – slide 20 ",
    "14_20": "Example for Depth-First Search The video recording shows a demonstration of dfs on the graph below: IADS – Lecture 14 – slide 21 ",
    "14_21": "Reading Today’s lecture: (cid:73) Graph representations in Section 22.1 (cid:73) Breadth-first search Section 22.2, Depth-first search Section 22.3 Next week: (cid:73) Showing why Depth-first search (and Breadth-first search) run in Θ(n + m) time. (cid:73) Computing connected components and topological sort Section 22.4 IADS – Lecture 14 – slide 22 ",
    "15_1": "Recursive DFS (no explicit Stack) Algorithm dfs(G ) 1. Initialise Boolean array visited , setting all to false 2. for all v ∈ V do 3. 4. if visited [v ] = false then dfsFromVertex(G , v ) Algorithm dfsFromVertex(G , v ) 1. visited [v ]← true for all w adjacent to v do if visited [w ] = false then dfsFromVertex(G , w ) 2. 3. 4. (cid:73) The recursive set-up eliminates the need for an explicit stack; (cid:73) We will have reversed prioritisation of the vertices adjacent to v . IADS – Lecture 15 – slide 2 ",
    "15_2": "Analysis of DFS Lemma During dfs(G ), dfsFromVertex(G , v ) is invoked exactly once for each vertex v . Proof. At least once: (cid:73) visited [v ] can only become true when dfsFromVertex(G , v ) is executed. (cid:73) If visited [v ] remains false, dfsFromVertex(G , v ) will eventually be called by line 4 of dfs(G ). At most once: (cid:73) First call of dfsFromVertex(G , v ) sets visited [v ] to true. (cid:73) After visited [v ] is true, dfsFromVertex(G , v ) is never called again. (“At most once” is also true for Stack dfs, but “at least once” is not. dfsFromVertex” is more to ”start a component” in the Stack version) IADS – Lecture 15 – slide 3 ",
    "15_3": "Analysis of DFS (cont’d) (cid:80) (cid:80) Lemma For a directed graph, For an undirected graph, v∈V out-degree(v ) = m. v∈V deg(v ) = 2m. Proof. Every edge is counted exactly once on both sides of the equation (for directed). For the undirected case, every edge is counted twice on the lhs. IADS – Lecture 15 – slide 4 ",
    "15_4": "Analysis of recursive DFS G = (V , E ) graph with n vertices and m edges Algorithm dfs(G ) 1. Initialise Boolean array visited , setting all to false 2. for all v ∈ V do 3. 4. (cid:73) dfs(G ): Ignoring calls to dfsFromVertex, total time Θ(n) (cid:73) dfsFromVertex(v ) is called at most once for every vertex v , and does if visited [v ] = false then dfsFromVertex(G , v ) Θ(out-degree(v )) work, excluding recursive calls. Overall time: (cid:80) (cid:80) (cid:16) T (n, m) = Θ(n) + n + = Θ = Θ(n + m) v∈V Θ(out-degree(v )) v∈V out-degree(v ) (cid:17) IADS – Lecture 15 – slide 5 ",
    "15_5": "Adjacency List or Adjacency Matrix? We said each call to dfsFromVertex(v ) takes Θ(out-degree(v )) time (excluding recursive calls). Algorithm dfsFromVertex(G , v ) 1. visited [v ]← true 2. 3. 4. for all w adjacent to v do if visited [w ] = false then dfsFromVertex(G , w ) If we are iterating over “all w adjacent to v ” in Θ(out-degree(v )) time, then we must be using an Adjacency list structure. IADS – Lecture 15 – slide 6 ",
    "15_6": "Analysis of original DFS Compare the two dfsFromVertex(G , v ) methods: Algorithm dfsFromVertex(G , v ) visited[v ]← true 1. 2. 3. 4. for all w adjacent to v do if visited[w ] = false then dfsFromVertex(G , w ) Algorithm dfsFromVertex(G , v ) u← S.pop() 1. S.push(v ) 2. while not S.isEmpty() do 3. 4. 5. 6. 7. if visited[u] = false then visited[u] = true for all w adjacent to u do S.push(w ) visited[v ]← true ↔ S.pop(); visited[v ]← true dfsFromVertex(v ) ↔ for all w adjacent to v ; S.push(w ); while Recursive: marks v as “visited”, then calls dfsFromVertex for unvisited adjacent vertices Iterative: marks v as “visited” after “popping” it, then “pushes” all adjacent vertices. However, the number of Stack operations for v is bounded in terms of the number of edges into v ⇒ the overall runtime for our original dfs is still Θ(n + m). IADS – Lecture 15 – slide 7 ",
    "15_7": "DFS Forests A DFS traversing a graph builds up a forest whose vertices are all vertices of the graph and whose edges are all vertices traversed during the DFS. Definition A vertex w is a child of a vertex v in the DFS forest if dfsFromVertex(G , w ) is called from dfsFromVertex(G , v ). IADS – Lecture 15 – slide 8 ",
    "15_8": "DFS Forests Example Recall Q2 of tutorial sheet 5 on how the connected components can vary depending on the order in which we consider vertices at the top-level of dfs. IADS – Lecture 15 – slide 9 02365410245163",
    "15_9": "Topological Sorting Example: 10 tasks to be carried out. Some of them depend on others. (cid:73) Task 0 must be completed before Task 1 can be started. (cid:73) Task 1 and Task 2 must be done before Task 3 can start. (cid:73) Task 4 must be done before Task 0 or Task 2 can start. (cid:73) Task 5 must be done before Task 0 or Task 4 can start. (cid:73) Task 6 must be done before Task 4, 5 or 7 can start. (cid:73) Task 7 must be done before Task 0 or Task 9 can start. (cid:73) Task 8 must be done before Task 7 or Task 9 can start. (cid:73) Task 9 must be done before Task 2 or Task 3 can start. IADS – Lecture 15 – slide 10 ",
    "15_10": "Topological order Definition Let G = (V , E ) be a directed graph. A topological order of G is a total order ≺ of the vertex set V such that for all edges (v , w ) ∈ E we have v ≺ w . (in some fields this is called a linear extension) IADS – Lecture 15 – slide 11 ",
    "15_11": "Tasks as a (directed) graph Does this graph have a topological order? Yes. One topological sort is: 8 ≺ 6 ≺ 7 ≺ 9 ≺ 5 ≺ 4 ≺ 2 ≺ 0 ≺ 1 ≺ 3. IADS – Lecture 15 – slide 12 5319476820",
    "15_12": "Topological order (cont’d) A digraph that has a cycle does not have a topological order. Definition A DAG (directed acyclic graph) is a digraph without cycles. Theorem A digraph has a topological order if and only if it is a DAG. IADS – Lecture 15 – slide 13 ",
    "15_13": "Classification of vertices during recursive DFS G = (V , E ) graph, v ∈ V . Consider dfs(G ). (cid:73) v is finished if dfsFromVertex(G , v ) has been completed. Vertices can be in the following states: (cid:73) not yet visited (let us call a vertex in this state white), (cid:73) visited, but not yet finished (grey). (cid:73) finished (black). IADS – Lecture 15 – slide 14 ",
    "15_14": "Classification of vertices during recursive DFS (cont’d) Lemma Let G be a graph and v a vertex of G . Consider the moment during the execution of dfs(G ) when dfsFromVertex(G , v ) is started. Then for all vertices w we have: 1. If w is white and reachable from v , then w will be black before v . 2. If w is grey, then v is reachable from w . IADS – Lecture 15 – slide 15 ",
    "15_15": "Topological sorting G = (V , E ) digraph. Define order on V as follows: v ≺ w ⇐⇒ w becomes black before v . Theorem If G is a DAG then ≺ is a topological order. Proof. Suppose (v , w ) ∈ E . Consider dfsFromVertex(G , v ). (cid:73) If w is already black, then v ≺ w (and this is what we want). (cid:73) If w is white, then by Lemma part 1., w will be black before v . Thus v ≺ w . (cid:73) If w is grey, then by Lemma part 2. v is reachable from w . So there is a path p from w to v . Path p and edge (v , w ) together form a cycle. Contradiction! (G is acyclic . . .) IADS – Lecture 15 – slide 16 ",
    "15_16": "Topological sorting implemented Algorithm topSort(G ) 1. Initialise array state by setting all entries to white. 2. Initialise linked list L 3. for all v ∈ V do 4. 5. 6. print L if state[v ] = white then sortFromVertex(G , v ) IADS – Lecture 15 – slide 17 ",
    "15_17": "Topological sorting implemented Algorithm sortFromVertex(G , v ) state[v ]← grey 1. 2. 3. 4. 5. 6. 7. 8. 9. L.insertFirst(v ) state[v ]← black for all w adjacent to v do if state[w ] = white then sortFromVertex(G , w ) else if state[w ] = grey then print “G has a cycle” halt Diﬀerence from dfs itself - the order the vertices get added to the list. Running-time is again Θ(n + m) IADS – Lecture 15 – slide 18 ",
    "15_18": "Example Use the algorithm topSort to compute a topological sort of this graph (video). IADS – Lecture 15 – slide 19 5319476820",
    "15_19": "Connected components of an undirected graph G = (V , E ) undirected graph Definition (cid:73) A subset C of V is connected if for all v , w ∈ C there is a path from v to w (if G is directed, say strongly connected). (cid:73) A connected component of G is a maximum connected subset C of V . (no connected subset C (cid:48) of V strictly contains C . (cid:73) G is connected if it only has one connected component, that is, if for all vertices v , w there is a path from v to w . IADS – Lecture 15 – slide 20 ",
    "15_20": "Connected components - undirected (cont’d) (cid:73) Each vertex of an undirected graph is contained in exactly one connected component. (cid:73) For each vertex v of an undirected graph, the connected component that contains v is precisely the set of all vertices that are reachable from v . For an undirected graph G , dfsFromVertex(G , v ) visits exactly the vertices in the connected component of v . And the same is true for bfsFromVertex(G , v ) (either will do!) IADS – Lecture 15 – slide 21 ",
    "15_21": "Connected components - undirected (cont’d) Algorithm connComp(G ) 1. Initialise Boolean array visited by setting all entries to false 2. for all v ∈ V do 3. 4. 5. if visited [v ] = false then print “New Component” ccFromVertex(G , v ) Algorithm ccFromVertex(G , v ) 1. visited [v ]← true 2. print v 3. 4. 5. for all w adjacent to v do if visited [w ] = false then ccFromVertex(G , w ) IADS – Lecture 15 – slide 22 ",
    "15_22": "Reading From [CLRS] as usual: (cid:73) Computing topological sort - Section 22.4 Hope you get a break over the holidays! And “see” you in 2022. IADS – Lecture 15 – slide 23 "
}